{"_id":{"$oid":"5a9537a26c005a10503432de"},"JobId":"79859246","ApplicationURL":"https://www.cwjobs.co.uk/job/79859246","Title":"Senior C# / C++ Quantitative developer","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eQuanteam Group is a Consulting firm specialised in the Capital Markets industry, in Paris, London, Brussels, New York and North Africa. \u003c/span\u003e\u003c/p\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eSince 2007, our 450 consultants provide major clients (Corporate \u0026amp; Investment Banks, Asset Managers, Hedge Funds, Brokers and Insurance Companies) with expertise in several projects such as Financial Engineering, Quantitative Research, Regulatory Implementation, IT Transformation \u0026amp; Innovation.\u003c/span\u003e\u003c/p\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eThe firm mainly takes part in:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"text-align: justify\"\u003e\u003cspan\u003eBusiness consulting: Quantitative research, Risk management (e.g. Market risk, credit risk, counterparty risk), Banking regulations (e.g. Basel III, Solvency II, FATCA, EMIR, MiFID), Pricing \u0026amp; Valuation, Organisational Transformation \u0026amp; Process Improvement.\u003c/span\u003e\u003c/li\u003e\u003cli style=\"text-align: justify\"\u003e\u003cspan\u003eIT \u0026amp; Information systems consulting: Business Analysis, Project Management, Change management, Front Office Support (functional and technical), Development (e.g C++, Python, C#, Java, VBA), Financial Softwares (e.g. Sophis, Murex, Summit, Calypso), IT Transformation \u0026amp; Innovation.\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eAs part of Quanteam Group, Quanteam UK (incorporated in 2010) has today more than 60 consultants, working for major Capital Markets players in London. \u003cbr\u003e\u003c/span\u003e\u003c/p\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003ePROJECTS\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cbr\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eQuanteam UK is currently working on various highly skilled projects, with several major Investment Banks in the City. \u003cbr\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn particular, we are looking to bring on board experienced Quantitative Developers with the following skills:\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eStrong C++ and/or C# programming background\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInvestment Banking Front Office / Quantitative Research experience is\u0026nbsp;\u003cu\u003erequired\u003c/u\u003e\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eA candidate with experience of C++ under Linux environment would be great but not mandatory\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eMicrosoft COM (Component Object Model) technology knowledge would be useful but is not a requirement \u003c/span\u003e\u003cspan\u003e(the client wishes to move from COM to Linux on the long run)\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eFinancial products knowledge is a plus, particularly on Fixed Income flow and derivatives products\u0026nbsp;\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eThis is a long term opportunity (\u0026gt; 1 year minimum).\u003c/span\u003e\u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eRecruitment Team\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e79859246\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432df"},"JobId":"80189142","ApplicationURL":"https://www.cwjobs.co.uk/job/80189142","Title":"DevOps Engineer","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eDevOps Engineer – London\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLondon \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e6 months+\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eStart date ASAP\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOur client is a leading ecommerce business and due to continued success, they are urgently looking for an experienced DevOps Engineer to join their dynamic city-based team.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eResponsibilities:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eWorking directly with product development teams following DevOps best practices. Primarily focused on the build and deployment\u003c/li\u003e\u003cli\u003eof high quality software products into a range of environment\u003c/li\u003e\u003cli\u003eCollaboration, involved in design, build and maintenance of applications deployed onto the private cloud and public cloud hosting on\u003c/li\u003e\u003cli\u003eAWS\u003c/li\u003e\u003cli\u003eLiaise with global tech teams to remove impediments and diagnose/prevent incidents. Protection of large revenue generating systems\u003c/li\u003e\u003cli\u003eIdentify improvements in systems and processes, leading change in the interests of quality, productivity and supportability\u003c/li\u003e\u003cli\u003ePartake in an on-call rota, which may require working weekends (once established as part of the future product development strategy)\u003c/li\u003e\u003cli\u003eChampion security standards \u0026amp; best practices, collaborating with dedicated teams\u003c/li\u003e\u003cli\u003eStrong analytical and problem-solving skills with a high attention to detail\u003c/li\u003e\u003cli\u003eAn ability to learn new technologies and adopt new tools\u003c/li\u003e\u003cli\u003eExcellent interpersonal skills suited to a dynamic working environment\u003c/li\u003e\u003cli\u003eManage multiple priorities and communicate effectively with stakeholders\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan style=\"text-decoration: underline\"\u003eSkills required: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eSupport/Administration of Linux (RHEL) in an enterprise environment\u003c/li\u003e\u003cli\u003eExposure to AWS services (EC2, S3, ECS, ALB)\u003c/li\u003e\u003cli\u003eExposure to Configuration Management tools (Puppet)\u003c/li\u003e\u003cli\u003eKnowledge of containerisation technologies (Docker)\u003c/li\u003e\u003cli\u003eExperience of effective CI/CD environments and technologies (Jenkins, Marathon and Mesos).\u003c/li\u003e\u003cli\u003eFamiliar with Enterprise Java Web/Application Server technologies (e.g. Apache HTTPD 2.x, Apache Tomcat) and SQL DB tech Oracle and Non-\u003c/li\u003e\u003cli\u003eSQL such as Cassandra\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eDesirable skills: \u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eHas worked directly on production environments and supported large revenue generating systems for large ecommerce organizations\u003c/li\u003e\u003cli\u003eA flexible style\u003c/li\u003e\u003cli\u003eSomeone that can collaborate and work with a range of development skillsets but looks to challenge everyone to continually\u003c/li\u003e\u003cli\u003eimprove\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIf you are a DevOps Engineer looking for a challenging contract opportunity, then apply with your CV to this advert today\u003c/p\u003e\u003cp\u003eAWS // LINUX // PUPPET // DOCKER // CI/CD // SQL // JENKINS // \u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAmie-Jayne Hudson\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/JO-1801-14503a\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80189142\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e0"},"JobId":"79973357","ApplicationURL":"https://www.cwjobs.co.uk/job/79973357","Title":"Senior C# Software Developer - Full Stack Agile Web TDD x 2 CONTRACT","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cspan\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eSenior C# Software Developer (\u003cu\u003eTest Driven Developer\u003c/u\u003e\u0026nbsp;C# ASP.NET MVC Full Stack Agile TDD Entity Framework SQL Server Jasmine JavaScript) x2 NEW CONTRACTS\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eContract 3 months with potential for extension\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eCONTRACT RATES - £400-£600 a Day\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eImmediate Start\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAsynchrony Labs UK, a subsidiary of WWT EMEA UK LTD., has opportunities for\u0026nbsp;\u003cspan style=\"font-weight: 600\"\u003eSenior C# Software Developer\u003c/span\u003e\u0026nbsp;\u003cspan style=\"font-weight: 600\"\u003e/Test Driven Developer\u003c/span\u003e\u0026nbsp;encompassing responsibilities along all areas of application development.\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eJOB ROLE:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eSenior C# Software Developer will be involved in detailed software design, pair-programming code with unit tests to implement the design, and enterprise architecture integration.\u003c/li\u003e\u003cli\u003eSenior C# Software Developer will be responsible for the analysis of business, engineering, and scientific problems, and the documentation and development of well-defined methods, procedures, and programs in the delivery of practical systems solutions.\u003c/li\u003e\u003cli\u003eInvolved in Full Stack development of projects from beginning to end.\u003c/li\u003e\u003cli\u003eWorking with peers through the full software development and project life cycle.\u003c/li\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eThis role is suitable for a Test Driven Developer, who enjoys working in a Agile environment of testing all development code in C# MVC and automation test tools environment.\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eESSENTIAL SKILLS/REQUIREMENTS:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eMin 5+ years' experience in software development C# and MVC area.\u003c/li\u003e\u003cli\u003eExperience in software development methodologies such as Agile in Kanban or SCRUM area.\u003c/li\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eMUST have C# MVC TDD Entity Framework (Code First) SQL Server and Agile\u003c/span\u003e\u003c/li\u003e\u003cli\u003eDeveloping Server Side technologies in C#, .NET and web Front End MVC ASP.NET\u003c/li\u003e\u003cli\u003eExperience of JavaScript development in JQuery\u003c/li\u003e\u003cli\u003eExperience using TFS with Git for version control, CI and build processes.\u003c/li\u003e\u003cli\u003eWe use Resharper and tests are done in NUnit for C#, Jasmine for JavaScript tests and Selenium with Specflow for Front End testing.\u003c/li\u003e\u003cli\u003eEntity Framework - Module First or Code first\u003c/li\u003e\u003cli\u003eExperience working with databases and SQL Server\u003c/li\u003e\u003cli\u003eExperience in Testing Tools: nUnit, Jasmine testing framework (JavaScript)\u003c/li\u003e\u003cli\u003eMust have experience in Entity Framework in Code first\u003c/li\u003e\u003cli\u003e\u003cb\u003eMust have experience in Test-Driven Development (TDD) - as we test all our own development code\u003c/b\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eSOLID Principles, Extreme Programming, SCRUM, OOD (Object Orientated Design and Development), BDD\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eUsing continuous integration (CI) tools and automated testing\u003c/li\u003e\u003cli\u003eDesign and architecture of large-scale applications\u003c/li\u003e\u003cli\u003eExperience of all elements of a full technology stack\u003c/li\u003e\u003cli\u003eAbility to work in a startup environment backed by a large enterprise\u003c/li\u003e\u003cli\u003eDesign and architecture of large-scale applications\u003c/li\u003e\u003cli\u003eExperience of all elements of a full technology stack\u003c/li\u003e\u003cli\u003eExcellent inter-personal skills and fluency in English (both verbal and written)\u003c/li\u003e\u003cli\u003eThis is an office based role here at our Canary Wharf offices in London\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eDESIRABLE SKILLS:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003ePair Programming - Must have knowledge in this area as this role requires you to do projects as a pair programmer.\u003c/li\u003e\u003cli\u003eBehavior-Driven Development (BDD)\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eApplicants must be eligible to live and work in the UK. Only successful candidates will be contacted.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eKEYWORDS:\u003c/span\u003e\u003c/p\u003e\u003cp\u003eSenior Software Developer Test Driven Developer C# .NET ASP.NET MVC MVC.NET Frontend Web Developer Mobile Developer Full Stack Android iOS Agile Pair Programming TDD Kanban Enterprise Web Applications Lead Mobile Developer iOS and Android C# Software Developer C# Developer .NET Software Developer C# Developer .NET Analyst Programmer .NET Application Developer C# Software Engineer C# Analyst Programmer .NET Senior Developer .NET Senior Software Engineer C# Senior Web Application Developer .NET Senior Web Application Developer, iOS, Windows Phone, Android, React-Native, SCRUM, Extreme Programming, Android and iOS Developer, Backend Development, XP C C++ Senior Web Developer\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eCompany:\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe world is changing - fast. To keep pace, companies need to find new ways to get to market faster, disrupt the status quo, optimize operational models, and create experiences their employees and consumers desire. Companies know they must embrace digital, but too often they start the process at the end - with prescriptive technology. We start with the customer.\u003c/p\u003e\u003cp\u003eAsynchrony Labs identifies business needs - then designs, develops, and integrates custom software solutions for clients across the Department of Defense, Health Care, Financial Services, Retail and every industry in-between. Our flexible methodologies and multi-disciplined delivery teams promote intuitive experiences, unparalleled quality, regular analysis of metrics, and iterative product testing.\u003c/p\u003e\u003cp\u003eBacked by World Wide Technology (WWT) - a $9B global technology integrator with expertise across supply chain, networking, collaboration, and security - we form a unique nucleus of end-to-end creative and technology capabilities needed to help transform our clients' businesses at scale. Our teams are deeply connected and bring their shared insights across industries, disciplines, and markets to every engagement.\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eEQUAL OPPORTUNITIES\u003cbr\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eWorld Wide Technology is committed to equal opportunities and actively seeks applications from all sectors of the community irrespective of sex, race, colour, nationality, ethnic or national origin, disability, marital status, sexual orientation, having responsibility for dependents, age, religion/beliefs, or any other reason which cannot be shown to be justified.\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003e\u003cu\u003eSTRICTLY NO AGENCIES - ONLY DIRECT APPLICATIONS\u003c/u\u003e\u003c/span\u003e\u003c/p\u003e\u003c/span\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eDina Hussain\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/CW/C#CONTRACT\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e79973357\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e1"},"JobId":"79949957","ApplicationURL":"https://www.cwjobs.co.uk/job/79949957","Title":".Net Senior Developer-Contract","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cspan\u003eSenior .Net Developer - ASP.Net Core MVC, C#, Docker, AWS, Team City, Git, TDD\u003c/span\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eFull Stack .Net Engineer needed to join our Tribe and work with one of our scrum teams to help us keep our customers happy, solve the challenges of continuous delivery in a rapidly growing platform whilst in an evolving marketplace. For us, teamwork is everything. We listen to each other, we adapt and we value honest feedback to help us keep on improving. We are making significant investment in DevOps at scale and we will invest in you.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eOur Tech Stack/Tools\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eC#, .Net Core MVC, CSS/jQuery, react, SQL Server\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eTDD, Agile, pair programming\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eGitHub, Team City, Octopus CI/CD deploy pipeline\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eAWS, Terraform, Docker Containers, ECS\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eKibana, Grafana Dashboard and Exceptionless\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eA typical week as a developer might involve:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eStart your day with a stand up, then spin up your vm and bham, you're ready to go\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003ePair with your team mates, write some tests and implement your app\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eRealise a team member has left their laptop unlocked and turn their screen upside down (unwritten rule - don't do this to your pairing partner)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eReview a pull request and deploy to production through your CI pipeline - pat yourself on the back\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eCoffee and Table Tennis break in the morning, then pop to Borough Market for lunch or go to a “lunch \u0026amp; learn”\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eCome across a show stopper, figure out as a team what to do, run some whiteboard design sessions (realising you've used a permanent marker, you quickly leave the room)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eDesign and experiment in your team retro on the roof terrace\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eMingle with peeps from other tribes at Innovation day demos with beers and snacks\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat we’d like from you:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eBring your whole self to work\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eAbility and/or experience to mentor, guide and lead by example\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eSuper interested in all things technical\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eWilling to participate in and often lead technical discussion(s)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eCommitment to high quality, maintainable code\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eHappy to collaborate with a wide group of stakeholders\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eCool stuff you’ll like:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eWeekly exercise club\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003e10th floor roof terrace with bar (yoga on a Monday, drinks on Thursday/Friday)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eScrum team social budget for lunch and events\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eTribe events and socials\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eMonthly innovation day (work on whatever you like)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eHackathons\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eFree nerf guns and ammo\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eAmazing location – Tate Modern, The Globe, Borough Market\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eSubsidised canteen with a view\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eSo, why us?\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWe have a simple purpose – to enable job seekers and organisations to achieve greater success. Our people are helping 9 million job seekers to find their dream job every month. Our websites are visited nearly 18 million times per month with over 80 million page impressions. Our expert matching technology, and best in class UX drives over 5.2 million applications every month.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSince becoming part of the StepStone family, we’ve focussed on creating a unique and collaborative culture where we all share the same values and beliefs that makes Totaljobs Group an even better place to build your career. Our people are the key to our success and they have voted us to be a Great Place to Work for the past 10 years!\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThis is your chance to join us and make a huge impact as we continue the journey to become smarter and more efficient than ever before. Apply now! You know you want to…\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAndrew Ward\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/1359\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e79949957\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e2"},"JobId":"80146213","ApplicationURL":"https://www.cwjobs.co.uk/job/80146213","Title":"Senior .Net Developer- Contract","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cstrong\u003eCONTRACT - Senior .Net Developer - ASP.Net Core MVC, C#, Docker, AWS, Team City, Git, TDD\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp style=\"text-align: justify\"\u003eFull Stack .Net Engineer needed to join our Tribe and work with one of our scrum teams to help us keep our customers happy, solve the challenges of continuous delivery in a rapidly growing platform whilst in an evolving marketplace. For us, teamwork is everything. We listen to each other, we adapt and we value honest feedback to help us keep on improving. We are making significant investment in DevOps at scale and we will invest in you.\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eOur Tech Stack/Tools\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eC#, .Net Core MVC, CSS/jQuery, react, SQL Server\u003c/li\u003e\u003cli\u003eTDD, Agile, pair programming\u003c/li\u003e\u003cli\u003eGitHub, Team City, Octopus CI/CD deploy pipeline\u003c/li\u003e\u003cli\u003eAWS, Terraform, Docker Containers, ECS\u003c/li\u003e\u003cli\u003eKibana, Grafana Dashboard and Exceptionless\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eA typical week as a developer might involve:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eStart your day with a stand up, then spin up your vm and bham, you're ready to go\u003c/li\u003e\u003cli\u003ePair with your team mates, write some tests and implement your app\u003c/li\u003e\u003cli\u003eRealise a team member has left their laptop unlocked and turn their screen upside down ctrl+alt+? (unwritten rule - don't do this to your pairing partner)\u003c/li\u003e\u003cli\u003eReview a pull request and deploy to production through your CI pipeline - pat yourself on the back\u003c/li\u003e\u003cli\u003eCoffee and Table Tennis break in the morning, then pop to Borough Market for lunch or go to a “lunch \u0026amp; learn”\u003c/li\u003e\u003cli\u003eCome across a show stopper, figure out as a team what to do, run some whiteboard design sessions (realising you've used a permanent marker, you quickly leave the room)\u003c/li\u003e\u003cli\u003eDesign and experiment in your team retro on the roof terrace\u003c/li\u003e\u003cli\u003eMingle with peeps from other tribes at Innovation day demos with beers and snacks\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eWhat we’d like from you:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eBring your whole self to work\u003c/li\u003e\u003cli\u003eAbility and/or experience to mentor, guide and lead by example\u003c/li\u003e\u003cli\u003eSuper interested in all things technical\u003c/li\u003e\u003cli\u003eWilling to participate in and often lead technical discussion(s)\u003c/li\u003e\u003cli\u003eCommitment to high quality, maintainable code\u003c/li\u003e\u003cli\u003eHappy to collaborate with a wide group of stakeholders\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eCool stuff you’ll like:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eWeekly exercise club\u003c/li\u003e\u003cli\u003e10th floor roof terrace with bar (yoga on a Monday, drinks on Thursday/Friday)\u003c/li\u003e\u003cli\u003eScrum team social budget for lunch and events\u003c/li\u003e\u003cli\u003eTribe events and socials\u003c/li\u003e\u003cli\u003eMonthly innovation day (work on whatever you like)\u003c/li\u003e\u003cli\u003eHackathons\u003c/li\u003e\u003cli\u003eFree nerf guns and ammo\u003c/li\u003e\u003cli\u003eAmazing location – Tate Modern, The Globe, Borough Market\u003c/li\u003e\u003cli\u003eSubsidised canteen with a view\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eSo, why us?\u003c/strong\u003e\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eWe have a simple purpose – to enable job seekers and organisations to achieve greater success. Our people are helping 9 million job seekers to find their dream job every month. Our websites are visited nearly 18 million times per month with over 80 million page impressions. Our expert matching technology, and best in class UX drives over 5.2 million applications every month.\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eSince becoming part of the StepStone family, we’ve focussed on creating a unique and collaborative culture where we all share the same values and beliefs that makes Totaljobs Group an even better place to build your career. Our people are the key to our success and they have voted us to be a Great Place to Work for the past 10 years!\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eThis is your chance to join us and make a huge impact as we continue the journey to become smarter and more efficient than ever before. Apply now! You know you want to…\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAndrew Ward\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/1309\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80146213\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e3"},"JobId":"80060947","ApplicationURL":"https://www.cwjobs.co.uk/job/80060947","Title":"Senior Developer","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eCONTRACT - Senior .Net Developer - ASP.Net Core MVC, C#, Docker, AWS, Team City, Git, TDD\u003c/strong\u003e\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eFull Stack .Net Engineer needed to join our Tribe and work with one of our scrum teams to help us keep our customers happy, solve the challenges of continuous delivery in a rapidly growing platform whilst in an evolving marketplace. For us, teamwork is everything. We listen to each other, we adapt and we value honest feedback to help us keep on improving. We are making significant investment in DevOps at scale and we will invest in you.\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eOur Tech Stack/Tools\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eC#, .Net Core MVC, CSS/jQuery, react, SQL Server\u003c/li\u003e\u003cli\u003eTDD, Agile, pair programming\u003c/li\u003e\u003cli\u003eGitHub, Team City, Octopus CI/CD deploy pipeline\u003c/li\u003e\u003cli\u003eAWS, Terraform, Docker Containers, ECS\u003c/li\u003e\u003cli\u003eKibana, Grafana Dashboard and Exceptionless\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eA typical week as a developer might involve:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eStart your day with a stand up, then spin up your vm and bham, you're ready to go\u003c/li\u003e\u003cli\u003ePair with your team mates, write some tests and implement your app\u003c/li\u003e\u003cli\u003eRealise a team member has left their laptop unlocked and turn their screen upside down (unwritten rule - don't do this to your pairing partner)\u003c/li\u003e\u003cli\u003eReview a pull request and deploy to production through your CI pipeline - pat yourself on the back\u003c/li\u003e\u003cli\u003eCoffee and Table Tennis break in the morning, then pop to Borough Market for lunch or go to a “lunch \u0026amp; learn”\u003c/li\u003e\u003cli\u003eCome across a show stopper, figure out as a team what to do, run some whiteboard design sessions (realising you've used a permanent marker, you quickly leave the room)\u003c/li\u003e\u003cli\u003eDesign and experiment in your team retro on the roof terrace\u003c/li\u003e\u003cli\u003eMingle with peeps from other tribes at Innovation day demos with beers and snacks\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eWhat we’d like from you:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eBring your whole self to work\u003c/li\u003e\u003cli\u003eAbility and/or experience to mentor, guide and lead by example\u003c/li\u003e\u003cli\u003eSuper interested in all things technical\u003c/li\u003e\u003cli\u003eWilling to participate in and often lead technical discussion(s)\u003c/li\u003e\u003cli\u003eCommitment to high quality, maintainable code\u003c/li\u003e\u003cli\u003eHappy to collaborate with a wide group of stakeholders\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eCool stuff you’ll like:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eWeekly exercise club\u003c/li\u003e\u003cli\u003e10th floor roof terrace with bar (yoga on a Monday, drinks on Thursday/Friday)\u003c/li\u003e\u003cli\u003eScrum team social budget for lunch and events\u003c/li\u003e\u003cli\u003eTribe events and socials\u003c/li\u003e\u003cli\u003eMonthly innovation day (work on whatever you like)\u003c/li\u003e\u003cli\u003eHackathons\u003c/li\u003e\u003cli\u003eFree nerf guns and ammo\u003c/li\u003e\u003cli\u003eAmazing location – Tate Modern, The Globe, Borough Market\u003c/li\u003e\u003cli\u003eSubsidised canteen with a view\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eSo, why us?\u003c/strong\u003e\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eWe have a simple purpose – to enable job seekers and organisations to achieve greater success. Our people are helping 9 million job seekers to find their dream job every month. Our websites are visited nearly 18 million times per month with over 80 million page impressions. Our expert matching technology, and best in class UX drives over 5.2 million applications every month.\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eSince becoming part of the StepStone family, we’ve focussed on creating a unique and collaborative culture where we all share the same values and beliefs that makes Totaljobs Group an even better place to build your career. Our people are the key to our success and they have voted us to be a Great Place to Work for the past 10 years!\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eThis is your chance to join us and make a huge impact as we continue the journey to become smarter and more efficient than ever before. Apply now! You know you want to…\u003c/p\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAndrew Ward\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/1391\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80060947\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e4"},"JobId":"80174733","ApplicationURL":"https://www.cwjobs.co.uk/job/80174733","Title":"DevOps Engineer","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eDevOps Engineer – London\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLondon \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e6 months+\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eStart date ASAP\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOur client is a leading ecommerce business and due to continued success, they are urgently looking for an experienced DevOps Engineer to join their dynamic city-based team.\u003c/p\u003e\u003cp\u003e\u003cspan style=\"text-decoration: underline\"\u003eSkills required: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eSupport/Administration of Linux (RHEL) in an enterprise environment\u003c/li\u003e\u003cli\u003eExposure to AWS services (EC2, S3, ECS, ALB)\u003c/li\u003e\u003cli\u003eExposure to Configuration Management tools (Puppet)\u003c/li\u003e\u003cli\u003eKnowledge of containerisation technologies (Docker)\u003c/li\u003e\u003cli\u003eExperience of effective CI/CD environments and technologies (Jenkins, Marathon and Mesos).\u003c/li\u003e\u003cli\u003eFamiliar with Enterprise Java Web/Application Server technologies (e.g. Apache HTTPD 2.x, Apache Tomcat) and SQL DB tech Oracle and Non-\u003c/li\u003e\u003cli\u003eSQL such as Cassandra\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eDesirable skills: \u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eHas worked directly on production environments and supported large revenue generating systems for large ecommerce organizations\u003c/li\u003e\u003cli\u003eA flexible style\u003c/li\u003e\u003cli\u003eSomeone that can collaborate and work with a range of development skillsets but looks to challenge everyone to continually\u003c/li\u003e\u003cli\u003eimprove\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIf you are a DevOps Engineer looking for a challenging contract opportunity, then apply with your CV to this advert today\u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eWill Sutton\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/JO-1801-145031\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80174733\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e5"},"JobId":"80229053","ApplicationURL":"https://www.cwjobs.co.uk/job/80229053","Title":"SQL Developer - 15 days","Description":"\r\n    \u003cp\u003e\r\n        We have an urgent requirement for a SQL Developer with experience of NHS Data sets and EPR systems - preferably Systmone - to develop procedures to create viable data sets from Systmone Community Health data. You will be required to engage with services to pursue completion of mandatory and desirable data fields to utilise from 01 April. you will also be required to provide clear documentation about what has been developed, where it is stored and how to run procedures.\u003cbr\u003e\u003cbr\u003eResponsibilities include:\u003cbr\u003e* Extract raw data from SystmOne SR tables.\u003cbr\u003e* Transfer into correct formats and ensure correctly mapped fields by NHSI CSDS guidance.\u003cbr\u003e* Map the national codes currently from the SR tables, spot any gaps and record clear, detailed recommendations where CNWL CH services and/or Systems configuration is needed to fix it. \u003cbr\u003e* Set up ETL procedures, Alpha test the outputs and cross check for completeness and accuracy from other sources and from knowledge and experience of CNWL colleagues.\u003cbr\u003e\u003cbr\u003eEssential Experience includes:\u003cbr\u003e* Excellent documentation skills, \u003cbr\u003e* Advanced SQL.\u003cbr\u003e* Advanced knowledge and use of SystmOne\u003cbr\u003e* Working knowledge of NHS Community services OR close proximity working to an analyst who can give rapid insight and support when needed.\u003cbr\u003e* Excellent communication skills / quick learner of new technical information.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eLA International Computer Consultants Ltd is an HMG Approved Consultancy and operates as an IT \u0026amp; Engineering Consultancy or as an Employment Business \u0026amp; Agency, depending upon the precise nature of the work, for security cleared jobs or non-clearance vacancies, we welcome applications from all sections of the community and from people with diverse experience and backgrounds. Award Winning LA International Computer Consultants Ltd (Recruiter Awards for Excellence - Best IT, Best Public Sector \u0026amp; Gold Awards) and the most prestigious award that any business can receive The Queens Award for Enterprise: International Trade 2015.\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eHelen Warham\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/HW/096662/SQL\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80229053\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e6"},"JobId":"80229523","ApplicationURL":"https://www.cwjobs.co.uk/job/80229523","Title":"Senior Data Warehouse Tester","Description":"\r\n    \u003cp\u003e\r\n        Senior Data Warehouse Tester \u003cbr\u003e Watford\u003cbr\u003e 9 months\u003cbr\u003e £350 - £450 per day depending on experience\u003cbr\u003e\u003cbr\u003eA Senior Data Warehouse Tester is required to join one of my prestigious clients based near Watford on an initial 9 months contract paying between £350 - £450 per day depending on experience.\u003cbr\u003e\u003cbr\u003eAs the Senior Data Warehouse Tester, you will work closely with the Test Manager and carry out all testing for a Dimensional Data Warehouse, Reports and Cubes built on SQL Server 2016/2017.\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eKey responsibilities for the Senior Data Warehouse Tester include:\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e* Work with the Test Manager and the DWH Project Manager to create the Test Strategy/ Test Approach document\u003cbr\u003e * Create high-level Test Scenarios and Detailed Test Cases covering all aspects for the Data Warehouse Development\u003cbr\u003e * Work with the DWH Development DBA/ Lead BI Developer to create an approach to testing all the Database Objects (using a test lead development approach)\u003cbr\u003e * Work with the DWH Business Analyst to determine the Test Data which will be used; \u003cbr\u003e * Manage End Users through the User Acceptance Testing\u003cbr\u003e * Carry out Performance Testing of the DWH solution as and when required \u003cbr\u003e * Work with the IT Support Team to carry out any Operational Acceptance Testing required\u003cbr\u003e * Work with the DWH Development DBA/ Lead BI Developer to set-up and refresh all the Development and Test environments\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eEssential skills required for the Senior Data Warehouse Tester include:\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e* Proven experience in Data Warehouse Testing\u003cbr\u003e * Strong hands-on manual \u0026amp; Automation testing experience \u003cbr\u003e * Good understanding of Dimensional Data Warehousing using MS SQL Server 2016/2017\u003cbr\u003e * Strong experience in writing complex SQL/TSQL queries to test databases and Data Warehouses, perform data manipulation and verification and set up test data.\u003cbr\u003e * Proven adaptive test strategies gained from test experience across Agile, Waterfall, Kanban SDLC processes.\u003cbr\u003e * Strong experience of planning test scenarios, writing and executing test plans and test cases, and creating required test data.\u003cbr\u003e * Strong problem-solving skills, ability to think ahead, with good eye for detail and routing out / searching those dark corners.\u003cbr\u003e * Genuine interest in the power of data/technology and a curious mind.\u003cbr\u003e * Performance Testing of MS SSRS Reports \u0026amp; Dashboards and MS SSAS Cubes\u003cbr\u003e\u003cbr\u003eThe culture is one that promotes creativity and the ability to think outside of the box. To apply for this role please urgently click apply.\u003cbr\u003e\u003cbr\u003e Venturi is a staffing business dedicated to you, differentiating ourselves in the marketplace by quality of service and candidate delivery. Our highly skilled and experienced staff operate within dedicated markets to give you the best service possible. Venturi markets include Business Intelligence, Development IT \u0026amp; Legal IT. Venturi operates as an employment agency and employment business. No terminology in this advert is intended to discriminate on the grounds of age, and we confirm that we are happy to accept applications from persons of any age for this role.\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eDaniel Thornton\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/BBBH28903\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80229523\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e7"},"JobId":"80229687","ApplicationURL":"https://www.cwjobs.co.uk/job/80229687","Title":"Senior QA Tester ( Data Warehouse, SQL Server, SSIS, ETL )","Description":"\r\n    \u003cp\u003e\r\n        Senior QA Tester ( Data Warehouse, SQL Server, SSIS, ETL ) \u003cbr\u003e Watford\u003cbr\u003e 9 months\u003cbr\u003e £350 - £450 per day depending on experience\u003cbr\u003e\u003cbr\u003eA Senior QA Tester ( Data Warehouse, SQL Server, SSIS, ETL ) is required to join one of my prestigious clients based near Watford on an initial 9 months contract paying between £350 - £450 per day depending on experience.\u003cbr\u003e\u003cbr\u003eAs the Senior QA Tester ( Data Warehouse, SQL Server, SSIS, ETL ) , you will work closely with the Test Manager and carry out all testing for a Dimensional Data Warehouse, Reports and Cubes built on SQL Server 2016/2017.\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eKey responsibilities for the Senior QA Tester ( Data Warehouse, SQL Server, SSIS, ETL ) include:\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e* Work with the Test Manager and the DWH Project Manager to create the Test Strategy/ Test Approach document\u003cbr\u003e * Create high-level Test Scenarios and Detailed Test Cases covering all aspects for the Data Warehouse Development\u003cbr\u003e * Work with the DWH Development DBA/ Lead BI Developer to create an approach to testing all the Database Objects (using a test lead development approach)\u003cbr\u003e * Work with the DWH Business Analyst to determine the Test Data which will be used; \u003cbr\u003e * Manage End Users through the User Acceptance Testing\u003cbr\u003e * Carry out Performance Testing of the DWH solution as and when required \u003cbr\u003e * Work with the IT Support Team to carry out any Operational Acceptance Testing required\u003cbr\u003e * Work with the DWH Development DBA/ Lead BI Developer to set-up and refresh all the Development and Test environments\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eEssential skills required for the Senior QA Tester ( Data Warehouse, SQL Server, SSIS, ETL ) include:\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e* Proven experience in Data Warehouse Testing\u003cbr\u003e * Strong hands-on manual \u0026amp; Automation testing experience \u003cbr\u003e * Good understanding of Dimensional Data Warehousing using MS SQL Server 2016/2017\u003cbr\u003e * Strong experience in writing complex SQL/TSQL queries to test databases and Data Warehouses, perform data manipulation and verification and set up test data.\u003cbr\u003e * Proven adaptive test strategies gained from test experience across Agile, Waterfall, Kanban SDLC processes.\u003cbr\u003e * Strong experience of planning test scenarios, writing and executing test plans and test cases, and creating required test data.\u003cbr\u003e * Strong problem-solving skills, ability to think ahead, with good eye for detail and routing out / searching those dark corners.\u003cbr\u003e * Genuine interest in the power of data/technology and a curious mind.\u003cbr\u003e * Performance Testing of MS SSRS Reports \u0026amp; Dashboards and MS SSAS Cubes\u003cbr\u003e\u003cbr\u003eThe culture is one that promotes creativity and the ability to think outside of the box. To apply for this role please urgently click apply.\u003cbr\u003e\u003cbr\u003e Venturi is a staffing business dedicated to you, differentiating ourselves in the marketplace by quality of service and candidate delivery. Our highly skilled and experienced staff operate within dedicated markets to give you the best service possible. Venturi markets include Business Intelligence, Development IT \u0026amp; Legal IT. Venturi operates as an employment agency and employment business. No terminology in this advert is intended to discriminate on the grounds of age, and we confirm that we are happy to accept applications from persons of any age for this role.\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eDaniel Thornton\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/BBBH28903\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80229687\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e8"},"JobId":"80229800","ApplicationURL":"https://www.cwjobs.co.uk/job/80229800","Title":"Data Scientist","Description":"\r\n    \u003cp\u003e\r\n        The role of \u003cstrong\u003eData Scientist\u003c/strong\u003e will be a key position within the Big Data analytics team.\u003cbr\u003e\u003cbr\u003eWe are looking for an experienced Data Scientist to work closely with the Lead Data Scientist to explore local countries Big Data Analytics opportunities as well as supporting and capitalising on Central Functional Team innovation initiatives. You will be working with key stakeholders within the local country to generate hypotheses and supports the analytics modelling managers to create models that answer impactful business questions.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eAs \u003cstrong\u003eData Scientist\u003c/strong\u003e your main responsibilities will involve:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eTranslating complex datasets into key strategic insight and powerful capabilities, to the business:\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eParticipating in cutting-edge research projects in collaboration with Universities e.g. Deep Learning, Social Network Analysis\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eSupport a global community of data scientists across countries and business streams\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eIdentify new analytics trends and opportunities to drive the innovation agenda across countries\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eIdentify new data sources and evaluate emerging technologies for data discovery usage\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eBe recognised as an expert in Big Data Analytics, advising on the suitability of Big Data products and solutions\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eAdvise the analytics modelling managers on best practice methodology for Big Data Analytics\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eDelve into data from different systems, at different timescales, and in complex formats to discover hidden relationships and useful information\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eAdvise on best practice Big Data Analytics methodology and processes for analytics insight generation, technology and data\u003cbr\u003e\u003cbr\u003eAs \u003cstrong\u003eData Scientist\u003c/strong\u003e your skills and qualifications will ideally include:\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cul\u003e\u003cli\u003eMachine learning Libraries - Spark ML, scikit-learn, xgboost, Tensorflow + Keras, GraphFrames\u003cbr\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eWorking knowledge of Big Data statistical analytics tools (e.g. Python, R, Scala)\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eExperience in Big Data Analytics landscape and technology trends (e.g. Spark, Hadoop, NoSQL, SQL)\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eFamiliar with leading visualisation tools (e.g. Tableau, Qlikview, Spotfire, D3.js)\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eSignificant experience in Big Data analytics \u0026amp; deployment of models and algorithms into a commercial/consumer environment in order to analyse extremely large volumes of structured data\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eAbility to test hypotheses from raw data sets and draw meaningful conclusions\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eDeep and broad statistical modelling expertise in various domains\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eGood communication skills, with proven ability to work cross-functional teams to translate business issues into potential analytics solutions\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003cbr\u003eMaster's or Bachelor's Degree in quantitative fields like Mathematics, Statistics, Economics, Computing and Engineering\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003ePlease email  your CV to be considered for the position.\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eHarry Back\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/Data Scientist-V\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80229800\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432e9"},"JobId":"80230102","ApplicationURL":"https://www.cwjobs.co.uk/job/80230102","Title":"Elite 3 Lead Developer","Description":"\r\n    \u003cp\u003e\r\n        \u003cstrong\u003eLead Elite 3E Developer \u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eCentral London \u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003e6-12 Months\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eup to £750 per day D.O.E\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003eA large consultancy I am working with have asked me to source a lead Elite 3E Developer for an immediate start in their central London office. This is an exciting opportunity to work for a leading law firm who are part of the UK \"magic circle\".\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eAs the lead Elite 3E Developer you will have the following key responsibilities and deliverables:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eLead software development work-streams providing end to end ownership including; specification and design, estimation and planning, build, release and support\u003c/li\u003e\u003cli\u003eDeveloping new software applications / modules / customisations in partnership with other members of the development team, business analysts and technical architects.\u003c/li\u003e\u003cli\u003eLiaise with business users as required within the role, maintaining a high level of service within all aspects of the individual's work\u003c/li\u003e\u003cli\u003eWork collaboratively as part of a team or individually to achieve business outcomes, maintaining constructive working relationships with IT peers\u003c/li\u003e\u003cli\u003eUnit testing software to ensure the code is correct, fixing errors where they occur, and rerunning and rechecking the programme until it produces the correct results\u003c/li\u003e\u003cli\u003eProvide 3rd level support to in-house developed applications, integrations and the Elite 3e product\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eEssential Technical Skills\u003c/strong\u003e\u003cul\u003e\u003cli\u003eElite 3E IDE and database structures.\u003c/li\u003e\u003cli\u003eExperience using Microsoft Visual Studio 2012 and above.\u003c/li\u003e\u003cli\u003eExtensive experience using Microsoft tools and programming languages.\u003c/li\u003e\u003cli\u003eDevelopment experience using the .NET framework.\u003c/li\u003e\u003cli\u003eStrong background in database design, analysis and development.\u003c/li\u003e\u003cli\u003eExperience in Microsoft SQL scripting and Server 2012.\u003c/li\u003e\u003cli\u003eExperience in producing reports from Elite 3E or similar systems.\u003c/li\u003e\u003cli\u003eExperience working with XML related technologies, including XSLT and Xpath.\u003c/li\u003e\u003cli\u003eExperience working with Web Service related technologies, including SOAP and REST.\u003c/li\u003e\u003cli\u003eMinimum of 2 years' of developing / supporting Elite 3E.\u003c/li\u003e\u003cli\u003eExperience of supporting test lifecycle's for Elite 3E Practice Management Systems.\u003c/li\u003e\u003cli\u003eExperience of Elite 3E modules, processes and technology.\u003c/li\u003e\u003cli\u003eAbility to interpret design documentation.\u003c/li\u003e\u003cli\u003eStrong communicator and able to present high quality documentation.\u003c/li\u003e\u003cli\u003eStrong planning and execution skills with attention to detail.\u003c/li\u003e\u003cli\u003eLeadership skills demonstrated through lead developer / or team lead roles covering planning, reporting, issue \u0026amp; risk management and people management skills.\u003c/li\u003e\u003cli\u003eAbility to work to strict deadlines.\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eDesirable Technical Skills\u003c/strong\u003e\u003cul\u003e\u003cli\u003eExperience of working with global stakeholders.\u003c/li\u003e\u003cli\u003eExperience of integrating Elite 3E with the IntApp technology stack, including IntApp Open and IntApp Integrate.\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003eElite 3E developer certification (advanced level desirable)\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eTo apply for the role please send your CV to\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eDanny Mclaughlin\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/BBBH28695\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80230102\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432ea"},"JobId":"80230639","ApplicationURL":"https://www.cwjobs.co.uk/job/80230639","Title":"Java Developer","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cp\u003e\u003cb\u003e\u003cspan\u003eJob role:\u003c/span\u003e\u003c/b\u003e\u003cspan\u003e Java Developer\u0026nbsp;\u003c/span\u003e\u003cspan\u003e\u003cbr\u003e\u003cb\u003e\u003cspan\u003eLocation:\u003c/span\u003e\u003c/b\u003e\u003cspan\u003e London (E14)\u003c/span\u003e\u003cbr\u003e\u003cb\u003e\u003cspan\u003eSalary:\u003c/span\u003e\u003c/b\u003e\u003cspan\u003e £500 Per day\u003c/span\u003e\u003cbr\u003e\u003cb\u003e\u003cspan\u003eType of Job:\u003c/span\u003e\u003c/b\u003e\u003cspan\u003e Contract\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003e\u003cspan\u003eInterview/Start:\u003c/span\u003e\u003c/b\u003e\u003cspan\u003e ASAP \u003c/span\u003e\u003cspan\u003e\u003cbr\u003e\u003cbr\u003e\u003c/span\u003e\u003cspan\u003eDriving success is one of the leading SAAS-based document automation and delivery pioneers for financial, legal and commercial applications. My client is on the search for a \u003cb\u003eJava Developer (support)\u003c/b\u003e.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003e\u003cspan\u003eThe Role:\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eAs a Java Developer (support), you will provide technical support for the client-facing Service Desk team, as well as internal teams.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eWorking on various new and legacy Java systems, from a workstream governed tightly by the Service Desk Manager. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eReport directly to the Service Desk Manager, and indirectly to the Head of IT, and your technical solutions and implementation will be governed by our Senior Java Team. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eWorking alongside other front-line technical support staff.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003e\u003cspan\u003eMandatory Technical Skills:\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eJava (Spring, Maven)\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eGit / Github \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eknowledge of Linux / Bash scripting \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eSSH\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eSQL (Postgresql)\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003e\u003cspan\u003eAdditional Skills:\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eJira\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eTomcat\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eApache\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eJenkins \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003ePlease do not be hesitant to contact me on 07547672611. \u003c/span\u003e\u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eRahul Patel\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/Rahul87\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80230639\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432eb"},"JobId":"80232329","ApplicationURL":"https://www.cwjobs.co.uk/job/80232329","Title":"Quant Developer -Fixed Income - Asset management - £700-800/Day","Description":"\r\n    \u003cp\u003e\r\n        Quant Developer - Fixed Income - Asset management - £700-800/Day \u003cbr\u003e \u003cbr\u003e Top tier London based asset management house with 500+ Bn AUM in Fixed Income is looking for a quant analyst/developer to come on board on a 6 months rolling contract paying around £750/day. \u003cbr\u003e \u003cbr\u003e There are 3 elements to this requirement: \u003cbr\u003e \u003cbr\u003e 1. Financial Mathematics - they are after someone that preferably has a PhD and is comfortable with maths. Solid experience working with quant libraries, writing models, doing research, reading papers, working in conjunction with other quant groups and traders and experience with derivatives pricing are all must haves for this role. \u003cbr\u003e \u003cbr\u003e 2. Business Knowledge - This is a fixed income business and therefore solid fixed income business knowledge is required. You will be the third member of this team and the other 2 current member have both been there for a while on long term rolling contracts. One has a speciality in FX and the other in Rates. Ideally they will want to find someone who is a heavy weight on Credit, but this is not essential as long as you have a through grounding on most fixed income products. \u003cbr\u003e \u003cbr\u003e 3. Coding - as with any quant role, there will be a fair amount of coding. They have a lot of C++ and are also migrating a lot of the VB/VBA into C#. They are expecting someone who has solid C++ and VBA skills that is willing to learn C#. If you have C# experience then that would be ideal as most of the dev work is done in C#\u003cbr\u003e \u003cbr\u003e My client is a looking for a dynamic quant who is looking for a long term opportunity. They are looking for an ideas person, someone that can help drive through strategy. \u003cbr\u003e \u003cbr\u003e There are some exciting new projects coming up that you will get your teeth stuck into immediately: Multi currency discounting project, FX Captions project, on boarding on new CDS Options, etc. \u003cbr\u003e \u003cbr\u003e If you are interested to learn more, please send your CV for immediate consideration\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eShilen Shah\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/SHSA15451512\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80232329\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432ec"},"JobId":"80233350","ApplicationURL":"https://www.cwjobs.co.uk/job/80233350","Title":"Front End Developer","Description":"\r\n    \u003cp\u003e\r\n        Our client, a growing Digital agency are searching for an innovative and experienced Senior/Lead Front-End Developer to join their ranks, you will be working on state-of-the-art projects for global clients, creating responsive websites and the development of well-designed web applications.\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eKey Responsibilities for this \u003c/strong\u003e\u003cstrong\u003eSenior/Lead Front-End Developer are:\u003c/strong\u003e\u003cbr\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eDeveloping cutting-edge solutions for clients\u003c/li\u003e\u003cli\u003eBuilding web and mobile interfaces\u003c/li\u003e\u003cli\u003eDesign and implement frontends using chosen APIs\u003c/li\u003e\u003cli\u003eDevising RESTful APIs and integration with 3rd party systems\u003c/li\u003e\u003cli\u003eSpeaking to clients to understand their requirements and concepts\u003c/li\u003e\u003cli\u003eDesigning and creating large, high volume systems\u003c/li\u003e\u003c/ul\u003e\u003cstrong\u003e\u003cbr\u003e \u003c/strong\u003e\u003cstrong\u003eSenior/Lead Front-End Key skills:\u003c/strong\u003e\u003cbr\u003e\u003cul\u003e\u003cli\u003eExcellent front-end skills, specifically HTML5 and CSS3\u003c/li\u003e\u003cli\u003e2-3 years’ experience in Core JavaScript programming.\u003c/li\u003e\u003cli\u003eCommercial experience with Front-End Frameworks/Libraries (AngularJS, Angular 2/4/5, React, Vue.js)\u003c/li\u003e\u003cli\u003eKnowledge of Node.js/Express.js framework and modules\u003c/li\u003e\u003cli\u003eKnowledge of Wordpress\u003c/li\u003e\u003cli\u003eExperience with tools such as grunt/gulp/Webpack\u003c/li\u003e\u003cli\u003eAbility to complete a project from beginning to end.\u003c/li\u003e\u003c/ul\u003e\u003cstrong\u003eAdvantageous skills to have:\u003c/strong\u003e\u003cbr\u003e\u003cul\u003e\u003cli\u003eDigital agency or Software solutions experience\u003c/li\u003e\u003cli\u003eExperience in using Amazon web services (AWS)\u003c/li\u003e\u003cli\u003eElectron.js\u003c/li\u003e\u003cli\u003eTypeScript\u003c/li\u003e\u003cli\u003eMobile development experience\u003c/li\u003e\u003cli\u003eUsing databases such as SQL, NoSQL, MySQL, Postgres and Redis\u003c/li\u003e\u003c/ul\u003eThis is definitely an opportunity you wouldn't want to miss! If you're interested and want to apply for this exciting opening please send over your CV to apply.\u003cbr\u003e \u003cbr\u003e Interviews are to take place immediately.\u003cbr\u003e \u003cbr\u003e \u003cstrong\u003eLocation\u003c/strong\u003e\u0026nbsp;– City Of London, United Kingdom\u0026nbsp;\u003cbr\u003e \u003cstrong\u003eJob Type\u003c/strong\u003e\u0026nbsp;– Contract\u0026nbsp;\u003cbr\u003e \u003cstrong\u003eSalary - \u003c/strong\u003e£300 - £350 P/D\u003cbr\u003e\u003cstrong\u003eStart – \u003c/strong\u003eImmediately\u003cstrong\u003e\u003cbr\u003e\u003c/strong\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eRavi Backory\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/RB/FD- Reactccon6\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80233350\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432ed"},"JobId":"80233617","ApplicationURL":"https://www.cwjobs.co.uk/job/80233617","Title":"VBA Lead Developer - Banking - Luxembourg - Contract","Description":"\r\n    \u003cp\u003e\r\n        My client are looking for a UK based VBA Lead Developer to work on a contract basis, working in Luxembourg, for a Leading Investment Bank.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eThe following is ESSENTIAL:\u003c/p\u003e\u003cul\u003e\u003cli\u003eStrong experience in Excel VBA development\u003c/li\u003e\u003cli\u003eExperience in creating Macro/VB Code within MS Excel.\u003c/li\u003e\u003cli\u003eWorking knowledge of Visual Basic Editor (VBE).\u003c/li\u003e\u003cli\u003eProficient skills in advanced spreadsheets, using validation, coding, ruling and macros.\u003c/li\u003e\u003cli\u003eMust have strong communication skills and proven ability in understanding business objectives and providing solutions accordingly.\u003c/li\u003e\u003cli\u003ePreferably have experience with SQL server\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eAn overview of responsibilities:\u003cul\u003e\u003cli\u003eWork with business users to develop and enhance systems/macro based applications.\u003c/li\u003e\u003cli\u003eDeveloping and maintaining automated solutions to business and operational problems.\u003c/li\u003e\u003cli\u003eWork to understand the data and database schema held within associated systems and macro based applications to enable to lead data migrations to other systems.\u003c/li\u003e\u003cli\u003eDevelop macros, databases and end-user applications to allow for bulk processing and enhancement of process controls\u003c/li\u003e\u003cli\u003eDesign and develop VBA application using the Best practices.\u003c/li\u003e\u003cli\u003eParticipate with team in designing conceptual model and working model and ensure consistency.\u003c/li\u003e\u003cli\u003ePerfom data operations in SQL server.\u003c/li\u003e\u003cli\u003eProvide ongoing support and maintenance of existing applications.\u003c/li\u003e\u003cli\u003eDesign custom UI pages, SQL Server, exporting data to the Microsoft Excel file.\u003c/li\u003e\u003cli\u003ePrepare Test Case and perform n-unit testings in coordination with Business owners.\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eRate: Up to £500/day\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eDuration: 6 months +\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eLocation: Luxembourg\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eIf you are interested in this Developer position and meet the above requirements please apply immediately.\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eStephen Perkins\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/723\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80233617\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432ee"},"JobId":"80233906","ApplicationURL":"https://www.cwjobs.co.uk/job/80233906","Title":"SQL Developer","Description":"\r\n    \u003cp\u003e\r\n        SQL Developer - SQL DBA - Asset Management - Investment Management - SQL - Fixed Income \u003cbr\u003e\u003cbr\u003eMy client, a leading London based Asset Manager are currently looking for a SQL Developer DBA to work as part of their in house development team.\u003cbr\u003e\u003cbr\u003eSuitable candidates must have excellent SQL SSRS, SSIS, SSAS skills gained working as a Developer or DBA within financial services, ideally investment management/ asset management. \u003cbr\u003e\u003cbr\u003eFixed income knowledge highly advantageous but not essential \u003cbr\u003e\u003cbr\u003eSQL Developer - SQL DBA - Asset Management - Investment Management - SQL - Fixed Income\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eJames Tobin\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/SQL Developer\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80233906\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432ef"},"JobId":"80189212","ApplicationURL":"https://www.cwjobs.co.uk/job/80189212","Title":"Analyst Developer / MI / Lloyds Insurance / Contract","Description":"\r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cspan\u003e\u003cspan\u003e\u003cb\u003eAnalyst Developer / MI / Lloyds Insurance / Contract\u003c/b\u003e\u003c/span\u003e\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e6 month contract with likely extension\u003c/div\u003e\u003cdiv\u003e\u003cspan\u003e\u003cspan\u003eImmediate start\u003c/span\u003e\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003eLloyds Insurance experience essential !\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eRole requirements\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e·Analysis of reporting requirements and experience in design of database and SSAS cube\u003c/p\u003e\u003cp\u003e·Development of ETL using SQL and SSIS to load a database that will be the source of cube data\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eDevelopment of an SSAS cube to make data available for analysis\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eData profiling and analysis in support of business analysts\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eStrong SSIS, SSAS and SQL skills\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eCo-ordinate with development team, adhering to standards\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eAddress testing defects and be able to provide development support to business testing \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eEssential: \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eLloyd’s market Insurance and\\or Reinsurance experience min 3 years\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eMicrosoft BI Stack Developer (SSIS\\SSAS\\ SSRS) min 5 years \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eData Warehouse experience min 5 years\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDesirable: \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eExperience developing Microsoft SQL Server 2016 or later\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eC#\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eExperience with Analytics Tools such as Pyramid, Tableau \u003c/span\u003e\u003c/p\u003e\u003cp\u003e·Finance experience\u003c/p\u003e\u003cp\u003e\u003cb\u003eAnalyst Developer / MI / Lloyds Insurance / Contract\u003c/b\u003e\u003c/p\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eJ-P Anquetil\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80189212\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432f0"},"JobId":"80234273","ApplicationURL":"https://www.cwjobs.co.uk/job/80234273","Title":"SQL Server Developer SSIS SSAS - Insurance - City","Description":"\r\n    \u003cp\u003e\r\n        SQL Server Developer (SQL Server 2008 / 2012 SSIS SSAS) Insurance - City\u003cbr\u003e\u003cbr\u003eRequired skills:\u003cbr\u003e\u003cbr\u003e* Strong development background with experience in SQL Server 2008 onwards including extensive hands on use of:\u003cbr\u003e o TSQL (including stored procedures)\u003cbr\u003e o SSIS\u003cbr\u003e o SSAS\u003cbr\u003e * Strong knowledge of database design and data warehouse principals and their application in Microsoft SQL Server \u003cbr\u003e * Exposure to BI reporting toolsets; experience with Cognos and/or ProClarity would be an advantage\u003cbr\u003e * Exposure to data warehouse testing techniques\u003cbr\u003e * Exposure to build practices associated with data warehouses\u003cbr\u003e * Able to produce high quality development deliverables and documentation artefacts\u003cbr\u003e * Appreciation of design patterns and practices that apply to the data warehouse space\u003cbr\u003e * A good working knowledge of TFS, code configuration management principals and deployment best practices\u003cbr\u003e * Have experience of working with integrated solutions\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eTom White\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/TW-DW/BIb\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80234273\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a9537a26c005a10503432f1"},"JobId":"80234560","ApplicationURL":"https://www.cwjobs.co.uk/job/80234560","Title":"C# Developer - Greenfield Trading Applications","Description":"\r\n    \u003cp\u003e\r\n        C# Developer - WPF, SQL, TDD\u003cbr\u003e\u003cbr\u003eA leading provider of trading solutions to traders, brokers and exchanges worldwide is seeking an accomplished C# Developer to join their London team. The successful C# Developer will be working on their flagship financial application providing Greenfield features.\u003cbr\u003e\u003cbr\u003eDesired skills as a C# Developer:\u003c/p\u003e\u003cul\u003e\u003cli\u003eC#\u003c/li\u003e\u003cli\u003eWPF, WCF\u003c/li\u003e\u003cli\u003eSQL Server\u003c/li\u003e\u003cli\u003eSCRUM, XP and Kanban\u003c/li\u003e\u003cli\u003eBDD / ATDD (Fit, FitNesse and others), TDD (UI and non-UI)\u003c/li\u003e\u003cli\u003eContinuous Integration, Jenkins, TFS BUILD\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003eThey are a hugely innovative company who are constantly striving to add new applications and functionality to their services, and never settle. The company themselves operate a relaxed, yet technically sharp, environment and are growing at a rapid pace.\u003cbr\u003e\u003cbr\u003eIf you are a C# Developer and would like to know more please apply for further details.\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eTom Nicholls\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/DSAS4946\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80234560\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 104846"}
{"_id":{"$oid":"5a95959c6c00361b443ad875"},"JobId":"80244172","ApplicationURL":"https://www.cwjobs.co.uk/job/80244172","Title":"Microsoft SSIS Consultant","Description":"Microsoft SSIS Consultant \r\n    \u003cp\u003e\r\n        UK brand require a skilled Microsoft SSIS Technical Consultant / Developer to join critical project as an expert in SQL Server Integration Services part of the Microsoft BI Suite.\u003cbr\u003e\u003cbr\u003eRequired skills / Experience\u003c/p\u003e\u003cul\u003e\u003cli\u003eExpert in Microsoft SSIS \u003c/li\u003e\u003cli\u003eKnowledge of Microsoft PDW ( Parallel Data Warehouse )\u003c/li\u003e\u003cli\u003eData Warehouse Expert\u003c/li\u003e\u003cli\u003eExpert in ETL\u003c/li\u003e\u003cli\u003eStrong in SQL and SQL Server\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003ePlease forward your CV for an immediate interview for this position.\u003cbr\u003e\u003cbr\u003eFPSG is committed to equal opportunities regardless of gender, race, disability, sexual orientation, religion or belief and age.\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eChris Knowles\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/CK/SSIS/MS/FPSG\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80244172\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad876"},"JobId":"80244540","ApplicationURL":"https://www.cwjobs.co.uk/job/80244540","Title":"FX Test Manager (Settlement/ Payments/ SWIFT)- Contract","Description":"FX Test Manager (Settlement/ Payments/ SWIFT)- Contract \r\n    \u003cp\u003e\r\n        I am currently looking for an experienced FX Test Manager (Settlements/ Payments/ SWIFT) to join a top financial organisation based in London. The role will be a contract role and will be working on a new project within the FX business.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eResponsibilities:\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eReview requirements, solution, design and other project specific technical documentation\u003cbr\u003e\u003cbr\u003eReview Test documentation\u003cbr\u003e\u003cbr\u003eProvide resource and test effort estimation\u003cbr\u003e\u003cbr\u003eProduce the Project Test Plan (with re-planning where necessary)\u003cbr\u003e\u003cbr\u003eAnalysing requirements and technical solutions in order to write Test Strategies for planned levels / phases of testing\u003cbr\u003e\u003cbr\u003eProduce Test Strategy and other project specific Test documentation\u003cbr\u003e\u003cbr\u003eAllocate tasks to team members and monitor team's progress\u003cbr\u003e\u003cbr\u003ePerforms the duties of a Tester as time from coordination allows; tests application to ensure it is working as specified, including use of test cases or on an ad-hoc basis, reports defects and other issues found during testing in the defect tracking system.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eExperience required:\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eExperienced Test Manager\u003cbr\u003e\u003cbr\u003eSoftware testing experience in the 'Financial Services' business domain (preferably in FX, Payment - RTGS, SWIFT)\u003cbr\u003e\u003cbr\u003eExtensive Software Testing experience, including roles within at least 5 medium to large projects\u003cbr\u003e\u003cbr\u003eExperience as a customer managing the delivery of at least one medium to large new system project (or a major new enhancement of an existing operational system) from a Third Party IT Vendor\u003cbr\u003e\u003cbr\u003eExperience of managing or working with teams within an off-shored service model\u003cbr\u003e\u003cbr\u003eExperience in producing various Test artefacts including Test Strategy / Plans, Test Scenarios, Test Scripts\u003cbr\u003e\u003cbr\u003eExperience in XMLs and database interrogation using SQL, Linux and Unix\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eContract (6 months with scope to extend)\u003cbr\u003e\u003cbr\u003e£400-500 per day\u003cbr\u003e\u003cbr\u003eLocation- London\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eIf you feel like you are a strong match for my requirements, please send me over an updated copy of CV and I will get back in touch.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eMcGregor Boyall is an equal opportunity employer and do not discriminate based on race, religion, gender, age, sexuality, gender identification, or physical ability.\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eConnor Choudhury\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/35456\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80244540\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad877"},"JobId":"79973357","ApplicationURL":"https://www.cwjobs.co.uk/job/79973357","Title":"Senior C# Software Developer - Full Stack Agile Web TDD x 2 CONTRACT","Description":"Senior C# Software Developer - Full Stack Agile Web TDD x 2 CONTRACT \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cspan\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eSenior C# Software Developer (\u003cu\u003eTest Driven Developer\u003c/u\u003e\u0026nbsp;C# ASP.NET MVC Full Stack Agile TDD Entity Framework SQL Server Jasmine JavaScript) x2 NEW CONTRACTS\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eContract 3 months with potential for extension\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eCONTRACT RATES - £400-£600 a Day\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eImmediate Start\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAsynchrony Labs UK, a subsidiary of WWT EMEA UK LTD., has opportunities for\u0026nbsp;\u003cspan style=\"font-weight: 600\"\u003eSenior C# Software Developer\u003c/span\u003e\u0026nbsp;\u003cspan style=\"font-weight: 600\"\u003e/Test Driven Developer\u003c/span\u003e\u0026nbsp;encompassing responsibilities along all areas of application development.\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eJOB ROLE:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eSenior C# Software Developer will be involved in detailed software design, pair-programming code with unit tests to implement the design, and enterprise architecture integration.\u003c/li\u003e\u003cli\u003eSenior C# Software Developer will be responsible for the analysis of business, engineering, and scientific problems, and the documentation and development of well-defined methods, procedures, and programs in the delivery of practical systems solutions.\u003c/li\u003e\u003cli\u003eInvolved in Full Stack development of projects from beginning to end.\u003c/li\u003e\u003cli\u003eWorking with peers through the full software development and project life cycle.\u003c/li\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eThis role is suitable for a Test Driven Developer, who enjoys working in a Agile environment of testing all development code in C# MVC and automation test tools environment.\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eESSENTIAL SKILLS/REQUIREMENTS:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eMin 5+ years' experience in software development C# and MVC area.\u003c/li\u003e\u003cli\u003eExperience in software development methodologies such as Agile in Kanban or SCRUM area.\u003c/li\u003e\u003cli\u003e\u003cspan style=\"font-weight: 600\"\u003eMUST have C# MVC TDD Entity Framework (Code First) SQL Server and Agile\u003c/span\u003e\u003c/li\u003e\u003cli\u003eDeveloping Server Side technologies in C#, .NET and web Front End MVC ASP.NET\u003c/li\u003e\u003cli\u003eExperience of JavaScript development in JQuery\u003c/li\u003e\u003cli\u003eExperience using TFS with Git for version control, CI and build processes.\u003c/li\u003e\u003cli\u003eWe use Resharper and tests are done in NUnit for C#, Jasmine for JavaScript tests and Selenium with Specflow for Front End testing.\u003c/li\u003e\u003cli\u003eEntity Framework - Module First or Code first\u003c/li\u003e\u003cli\u003eExperience working with databases and SQL Server\u003c/li\u003e\u003cli\u003eExperience in Testing Tools: nUnit, Jasmine testing framework (JavaScript)\u003c/li\u003e\u003cli\u003eMust have experience in Entity Framework in Code first\u003c/li\u003e\u003cli\u003e\u003cb\u003eMust have experience in Test-Driven Development (TDD) - as we test all our own development code\u003c/b\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eSOLID Principles, Extreme Programming, SCRUM, OOD (Object Orientated Design and Development), BDD\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eUsing continuous integration (CI) tools and automated testing\u003c/li\u003e\u003cli\u003eDesign and architecture of large-scale applications\u003c/li\u003e\u003cli\u003eExperience of all elements of a full technology stack\u003c/li\u003e\u003cli\u003eAbility to work in a startup environment backed by a large enterprise\u003c/li\u003e\u003cli\u003eDesign and architecture of large-scale applications\u003c/li\u003e\u003cli\u003eExperience of all elements of a full technology stack\u003c/li\u003e\u003cli\u003eExcellent inter-personal skills and fluency in English (both verbal and written)\u003c/li\u003e\u003cli\u003eThis is an office based role here at our Canary Wharf offices in London\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eDESIRABLE SKILLS:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003ePair Programming - Must have knowledge in this area as this role requires you to do projects as a pair programmer.\u003c/li\u003e\u003cli\u003eBehavior-Driven Development (BDD)\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eApplicants must be eligible to live and work in the UK. Only successful candidates will be contacted.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eKEYWORDS:\u003c/span\u003e\u003c/p\u003e\u003cp\u003eSenior Software Developer Test Driven Developer C# .NET ASP.NET MVC MVC.NET Frontend Web Developer Mobile Developer Full Stack Android iOS Agile Pair Programming TDD Kanban Enterprise Web Applications Lead Mobile Developer iOS and Android C# Software Developer C# Developer .NET Software Developer C# Developer .NET Analyst Programmer .NET Application Developer C# Software Engineer C# Analyst Programmer .NET Senior Developer .NET Senior Software Engineer C# Senior Web Application Developer .NET Senior Web Application Developer, iOS, Windows Phone, Android, React-Native, SCRUM, Extreme Programming, Android and iOS Developer, Backend Development, XP C C++ Senior Web Developer\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eCompany:\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe world is changing - fast. To keep pace, companies need to find new ways to get to market faster, disrupt the status quo, optimize operational models, and create experiences their employees and consumers desire. Companies know they must embrace digital, but too often they start the process at the end - with prescriptive technology. We start with the customer.\u003c/p\u003e\u003cp\u003eAsynchrony Labs identifies business needs - then designs, develops, and integrates custom software solutions for clients across the Department of Defense, Health Care, Financial Services, Retail and every industry in-between. Our flexible methodologies and multi-disciplined delivery teams promote intuitive experiences, unparalleled quality, regular analysis of metrics, and iterative product testing.\u003c/p\u003e\u003cp\u003eBacked by World Wide Technology (WWT) - a $9B global technology integrator with expertise across supply chain, networking, collaboration, and security - we form a unique nucleus of end-to-end creative and technology capabilities needed to help transform our clients' businesses at scale. Our teams are deeply connected and bring their shared insights across industries, disciplines, and markets to every engagement.\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003eEQUAL OPPORTUNITIES\u003cbr\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eWorld Wide Technology is committed to equal opportunities and actively seeks applications from all sectors of the community irrespective of sex, race, colour, nationality, ethnic or national origin, disability, marital status, sexual orientation, having responsibility for dependents, age, religion/beliefs, or any other reason which cannot be shown to be justified.\u003c/p\u003e\u003cp\u003e\u003cspan style=\"font-weight: 600\"\u003e\u003cu\u003eSTRICTLY NO AGENCIES - ONLY DIRECT APPLICATIONS\u003c/u\u003e\u003c/span\u003e\u003c/p\u003e\u003c/span\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eDina Hussain\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/CW/C#CONTRACT\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e79973357\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad878"},"JobId":"80224211","ApplicationURL":"https://www.cwjobs.co.uk/job/80224211","Title":"Capacity Manager (SC Clearance)","Description":"Capacity Manager (SC Clearance) \r\n    \u003cp\u003e\r\n        Capacity Manager (SC Cleared) \u003cbr\u003e\u003cbr\u003e3 Month + (view to extend) \u003cbr\u003e \u003cbr\u003e A new and fantastic opportunity has arisen for an SC Cleared Capacity Manager to join the Capacity Management Team in Hatfield. The successful candidate will ensure that all current and future capacity and performance aspects of the IT infrastructure are provided to meet business requirements at acceptable cost. Come and join our client's fantastic Capacity Management team in Hatfield and be part of what really makes them great. \u003cbr\u003e \u003cbr\u003e Main Responsibilities:\u003cbr\u003e Within their Capacity Management team in Hatfield, you will be establishing Capacity base lines for each customer contract, ensuring that there is adequate IT capacity to meet required levels of service, and that senior IT management is correctly advised on how to match capacity and demand and to ensure that use of existing capacity is optimised are key elements of this varied role. Reporting and presenting on discoveries that could impact components of the infrastructure to stakeholders at all levels. \u003cbr\u003e \u003c/p\u003e\u003cul\u003e\u003cli\u003eUnderstanding the current usage of the infrastructure and IT services, and the maximum capacity of each component\u003c/li\u003e\u003cli\u003eLiaise with Incident and Problem management to assess impact of Capacity related threshold breaches\u003c/li\u003e\u003cli\u003eAccumulate information for all new or changed infrastructures and define expansion requirements\u003c/li\u003e\u003cli\u003ePerform trend analysis, estimate overall growth (decrease) of user demand\u003c/li\u003e\u003cli\u003eForecasting future capacity requirements based on business plans, usage trends, sizing of new services, etc.\u003c/li\u003e\u003cli\u003eProduction, regular review and revision of the Capacity Plan, in line with the organization's business planning cycle, identifying current usage and forecast requirements during the period covered by the plan\u003c/li\u003e\u003cli\u003eAnalysis of usage and performance data, and reporting on Service and Component performance against targets contained in SLAs\u003c/li\u003e\u003cli\u003eEnsuring that all changes are assessed for their impact on capacity and performance and attending CAB meetings when appropriate\u003c/li\u003e\u003cli\u003eProducing regular management reports that include current usage of resources, trends and forecasts\u003c/li\u003e\u003c/ul\u003e \u003cbr\u003e \u003cbr\u003eThe Ideal Candidate: \u003cbr\u003e As an experienced Capacity Manager you will already have an understanding and experience in a capacity management background covering cloud, server, storage, networks, virtualised environments, applications and databases. Holding a deep knowledge of Capacity Management toolsets. BMC; VROps; SCOM; Power BI; Squared Up; SQL, these toolsets in particular would be an ideal with BMC TSCO, CLM being a stand out advantage. Bringing a sound understanding of ITIL methodology and service management best practices are a must to be a success in this role. \u003cbr\u003e \u003cbr\u003e Please note that due to the urgency of this role, preference will be given to candidates that are currently SC cleared, candidates that are willing to undergo the security clearance process will be considered however SC clearance is an essential requirement for this role\u003cbr\u003e \u003cbr\u003e If you are interested please apply online or call Oliver on 01162615046.\u003cbr\u003e\u003cbr\u003eHays Corporate Accounts is a trading division of Hays Specialist Recruitment Limited and acts as an employment agency for permanent recruitment and employment business for the supply of temporary workers. By applying for this job you accept the T\u0026amp;C's, Privacy Policy and Disclaimers which can be found at hays.co.uk\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eOliver Hall\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/3178304\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80224211\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad879"},"JobId":"80146213","ApplicationURL":"https://www.cwjobs.co.uk/job/80146213","Title":"Senior .Net Developer- Contract","Description":"Senior .Net Developer- Contract \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cstrong\u003eCONTRACT - Senior .Net Developer - ASP.Net Core MVC, C#, Docker, AWS, Team City, Git, TDD\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp style=\"text-align: justify\"\u003eFull Stack .Net Engineer needed to join our Tribe and work with one of our scrum teams to help us keep our customers happy, solve the challenges of continuous delivery in a rapidly growing platform whilst in an evolving marketplace. For us, teamwork is everything. We listen to each other, we adapt and we value honest feedback to help us keep on improving. We are making significant investment in DevOps at scale and we will invest in you.\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eOur Tech Stack/Tools\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eC#, .Net Core MVC, CSS/jQuery, react, SQL Server\u003c/li\u003e\u003cli\u003eTDD, Agile, pair programming\u003c/li\u003e\u003cli\u003eGitHub, Team City, Octopus CI/CD deploy pipeline\u003c/li\u003e\u003cli\u003eAWS, Terraform, Docker Containers, ECS\u003c/li\u003e\u003cli\u003eKibana, Grafana Dashboard and Exceptionless\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eA typical week as a developer might involve:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eStart your day with a stand up, then spin up your vm and bham, you're ready to go\u003c/li\u003e\u003cli\u003ePair with your team mates, write some tests and implement your app\u003c/li\u003e\u003cli\u003eRealise a team member has left their laptop unlocked and turn their screen upside down ctrl+alt+? (unwritten rule - don't do this to your pairing partner)\u003c/li\u003e\u003cli\u003eReview a pull request and deploy to production through your CI pipeline - pat yourself on the back\u003c/li\u003e\u003cli\u003eCoffee and Table Tennis break in the morning, then pop to Borough Market for lunch or go to a “lunch \u0026amp; learn”\u003c/li\u003e\u003cli\u003eCome across a show stopper, figure out as a team what to do, run some whiteboard design sessions (realising you've used a permanent marker, you quickly leave the room)\u003c/li\u003e\u003cli\u003eDesign and experiment in your team retro on the roof terrace\u003c/li\u003e\u003cli\u003eMingle with peeps from other tribes at Innovation day demos with beers and snacks\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eWhat we’d like from you:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eBring your whole self to work\u003c/li\u003e\u003cli\u003eAbility and/or experience to mentor, guide and lead by example\u003c/li\u003e\u003cli\u003eSuper interested in all things technical\u003c/li\u003e\u003cli\u003eWilling to participate in and often lead technical discussion(s)\u003c/li\u003e\u003cli\u003eCommitment to high quality, maintainable code\u003c/li\u003e\u003cli\u003eHappy to collaborate with a wide group of stakeholders\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eCool stuff you’ll like:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eWeekly exercise club\u003c/li\u003e\u003cli\u003e10th floor roof terrace with bar (yoga on a Monday, drinks on Thursday/Friday)\u003c/li\u003e\u003cli\u003eScrum team social budget for lunch and events\u003c/li\u003e\u003cli\u003eTribe events and socials\u003c/li\u003e\u003cli\u003eMonthly innovation day (work on whatever you like)\u003c/li\u003e\u003cli\u003eHackathons\u003c/li\u003e\u003cli\u003eFree nerf guns and ammo\u003c/li\u003e\u003cli\u003eAmazing location – Tate Modern, The Globe, Borough Market\u003c/li\u003e\u003cli\u003eSubsidised canteen with a view\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eSo, why us?\u003c/strong\u003e\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eWe have a simple purpose – to enable job seekers and organisations to achieve greater success. Our people are helping 9 million job seekers to find their dream job every month. Our websites are visited nearly 18 million times per month with over 80 million page impressions. Our expert matching technology, and best in class UX drives over 5.2 million applications every month.\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eSince becoming part of the StepStone family, we’ve focussed on creating a unique and collaborative culture where we all share the same values and beliefs that makes Totaljobs Group an even better place to build your career. Our people are the key to our success and they have voted us to be a Great Place to Work for the past 10 years!\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eThis is your chance to join us and make a huge impact as we continue the journey to become smarter and more efficient than ever before. Apply now! You know you want to…\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAndrew Ward\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/1309\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80146213\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad87a"},"JobId":"79920100","ApplicationURL":"https://www.cwjobs.co.uk/job/79920100","Title":"WebSphere Commerce Developer - Java - J2EE","Description":"WebSphere Commerce Developer - Java - J2EE \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cspan\u003e\u003cspan\u003e\u003cb\u003eWebSphere Commerce Developer - Java - J2EE\u003c/b\u003e\u003c/span\u003e\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cbr\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003eWebsphere Commerce Developer required as a result of continuing growth we are looking for a number of strong WebSphere Commerce Developers with varying levels of experience. Candidates with exposure to web based J2EE technologies required to deliver successful Client projects, including installing, configuring and developing customised code for WebSphere Commerce. You will also be involved in developing custom Controller Commands, EJBs and JSPs, performing the maintenance and modification of programs currently in production and coding new applications from predefined program specifications.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003eYou…\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cbr\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003eTalented, enthusiastic, focused, eye for detail, professional. Keen to learn and find new ways of doing things. A team player who is proud of your work and wants to share with everyone! You like working in a fast aced environment and are driven by the desire to improve the online purchasing experience for everyone, no matter what they are buying and from where!\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eYou will be client focused and be willing to be flexible when required to make them happy, including working at client locations.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003eThe techy bit….we need you to be really great at:\u003c/strong\u003e\u003c/div\u003e\u003cul\u003e\u003cli\u003eWebSphere Commerce (WC) functional architecture (e.g. store, catalog, merchandising, marketing, orders)\u003c/li\u003e\u003cli\u003eWC frameworks (e.g. Command framework, MVC,)\u003c/li\u003e\u003cli\u003eWC search\u003c/li\u003e\u003cli\u003eCommon WC data models (User, Orders, Catalogs, Promotions etc.)\u003c/li\u003e\u003cli\u003eWC messaging infrastructure (inbound and outbound, REST, MQ, BOD)\u003c/li\u003e\u003cli\u003eWC persistence layer (SDO and EJB/access/data beans)\u003c/li\u003e\u003cli\u003eCustomisation of all of the above\u003c/li\u003e\u003cli\u003eWC development environment, SVN and GIT repos\u003c/li\u003e\u003cli\u003eJava and J2EE development (e.g. JSP, EJB, JPA, Struts, Spring, core JAVA)\u003c/li\u003e\u003cli\u003eDevelop performant and secure code (incl. SQL) for high-traffic production use, following pre-defined principles and guidelines\u003c/li\u003e\u003cli\u003eDemonstrate and develop to WC best practices, especially with regards to security and customisations\u003c/li\u003e\u003cli\u003eHave a working knowledge of Dynacache\u003c/li\u003e\u003cli\u003eHave good front-end development skills in HTML, CSS and JS frameworks (e.g. JQuery) and are familiar with Ajax\u003c/li\u003e\u003c/ul\u003e\u003cdiv\u003e\u003cstrong\u003eIf you know some of this even better!\u003c/strong\u003e\u003c/div\u003e\u003cul\u003e\u003cli\u003eAn understanding of WC architecture and deployment models (e.g. 3-tier, de-coupled storefront/search)\u003c/li\u003e\u003cli\u003eExperience developing headless WC solutions\u003c/li\u003e\u003cli\u003eAn interest in the ongoing developments of WC (e.g. xC programming model, JPA)\u003c/li\u003e\u003cli\u003eWeb-tier configuration experience (e.g. Apache)\u003c/li\u003e\u003cli\u003eWorking knowledge of application server technologies (e.g. WebSphere Application Server)\u003c/li\u003e\u003cli\u003eHaving worked on solutions utilising edge-caches and CDNs\u003c/li\u003e\u003c/ul\u003e\u003cdiv\u003e\u003cstrong\u003eSalmon is a global digital commerce consultancy with operations in London, Amsterdam, Beijing, Melbourne and New Delhi and part of the WPP Group. \u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cbr\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003eOur aim is to define, design and deliver dynamic, high performance, state-of-the-art ecommerce sites for the world’s leading brands. We work for some of the best…Audi UK, GAME, Sainsburys’, Selfridges, Ted Baker and many more.\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cbr\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003eOur Salmon DNA is what pulls us all together. We want to make our client happy. Our reputation is based on having the best people in the business, who are honest and straight talking and really want to understand not just our clients but their customers. We are passionate about the innovative approach we take in everything we do and we are proud of what our teams achieve. We show respect for all and trust and empower our people and we won’t settle for second best!\u0026nbsp;\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cbr\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003eAs our business grows, so we need to find new people who share our values, work ethic and DNA. We especially want to encourage more Women to join us and take a key role in shaping and moulding some of the best ecommerce sites in the world.\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cbr\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003eWant to find out more about Salmon and our clients?\u0026nbsp;\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cbr\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003ewww.salmon.com\u0026nbsp;\u003c/strong\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eMichelle Guillena\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/WCDEV0118\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e79920100\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad87b"},"JobId":"80174733","ApplicationURL":"https://www.cwjobs.co.uk/job/80174733","Title":"DevOps Engineer","Description":"DevOps Engineer \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eDevOps Engineer – London\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLondon \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e6 months+\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eStart date ASAP\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOur client is a leading ecommerce business and due to continued success, they are urgently looking for an experienced DevOps Engineer to join their dynamic city-based team.\u003c/p\u003e\u003cp\u003e\u003cspan style=\"text-decoration: underline\"\u003eSkills required: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eSupport/Administration of Linux (RHEL) in an enterprise environment\u003c/li\u003e\u003cli\u003eExposure to AWS services (EC2, S3, ECS, ALB)\u003c/li\u003e\u003cli\u003eExposure to Configuration Management tools (Puppet)\u003c/li\u003e\u003cli\u003eKnowledge of containerisation technologies (Docker)\u003c/li\u003e\u003cli\u003eExperience of effective CI/CD environments and technologies (Jenkins, Marathon and Mesos).\u003c/li\u003e\u003cli\u003eFamiliar with Enterprise Java Web/Application Server technologies (e.g. Apache HTTPD 2.x, Apache Tomcat) and SQL DB tech Oracle and Non-\u003c/li\u003e\u003cli\u003eSQL such as Cassandra\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eDesirable skills: \u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eHas worked directly on production environments and supported large revenue generating systems for large ecommerce organizations\u003c/li\u003e\u003cli\u003eA flexible style\u003c/li\u003e\u003cli\u003eSomeone that can collaborate and work with a range of development skillsets but looks to challenge everyone to continually\u003c/li\u003e\u003cli\u003eimprove\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIf you are a DevOps Engineer looking for a challenging contract opportunity, then apply with your CV to this advert today\u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eWill Sutton\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/JO-1801-145031\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80174733\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad87c"},"JobId":"79949957","ApplicationURL":"https://www.cwjobs.co.uk/job/79949957","Title":".Net Senior Developer-Contract","Description":".Net Senior Developer-Contract \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cspan\u003eSenior .Net Developer - ASP.Net Core MVC, C#, Docker, AWS, Team City, Git, TDD\u003c/span\u003e\u003c/strong\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eFull Stack .Net Engineer needed to join our Tribe and work with one of our scrum teams to help us keep our customers happy, solve the challenges of continuous delivery in a rapidly growing platform whilst in an evolving marketplace. For us, teamwork is everything. We listen to each other, we adapt and we value honest feedback to help us keep on improving. We are making significant investment in DevOps at scale and we will invest in you.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eOur Tech Stack/Tools\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eC#, .Net Core MVC, CSS/jQuery, react, SQL Server\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eTDD, Agile, pair programming\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eGitHub, Team City, Octopus CI/CD deploy pipeline\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eAWS, Terraform, Docker Containers, ECS\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eKibana, Grafana Dashboard and Exceptionless\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eA typical week as a developer might involve:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eStart your day with a stand up, then spin up your vm and bham, you're ready to go\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003ePair with your team mates, write some tests and implement your app\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eRealise a team member has left their laptop unlocked and turn their screen upside down (unwritten rule - don't do this to your pairing partner)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eReview a pull request and deploy to production through your CI pipeline - pat yourself on the back\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eCoffee and Table Tennis break in the morning, then pop to Borough Market for lunch or go to a “lunch \u0026amp; learn”\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eCome across a show stopper, figure out as a team what to do, run some whiteboard design sessions (realising you've used a permanent marker, you quickly leave the room)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eDesign and experiment in your team retro on the roof terrace\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eMingle with peeps from other tribes at Innovation day demos with beers and snacks\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat we’d like from you:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eBring your whole self to work\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eAbility and/or experience to mentor, guide and lead by example\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eSuper interested in all things technical\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eWilling to participate in and often lead technical discussion(s)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eCommitment to high quality, maintainable code\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eHappy to collaborate with a wide group of stakeholders\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eCool stuff you’ll like:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eWeekly exercise club\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003e10th floor roof terrace with bar (yoga on a Monday, drinks on Thursday/Friday)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eScrum team social budget for lunch and events\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eTribe events and socials\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eMonthly innovation day (work on whatever you like)\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eHackathons\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eFree nerf guns and ammo\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eAmazing location – Tate Modern, The Globe, Borough Market\u003c/span\u003e\u003c/li\u003e\u003cli style=\"font-style: normal; font-weight: normal\"\u003e\u003cspan\u003eSubsidised canteen with a view\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eSo, why us?\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWe have a simple purpose – to enable job seekers and organisations to achieve greater success. Our people are helping 9 million job seekers to find their dream job every month. Our websites are visited nearly 18 million times per month with over 80 million page impressions. Our expert matching technology, and best in class UX drives over 5.2 million applications every month.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSince becoming part of the StepStone family, we’ve focussed on creating a unique and collaborative culture where we all share the same values and beliefs that makes Totaljobs Group an even better place to build your career. Our people are the key to our success and they have voted us to be a Great Place to Work for the past 10 years!\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThis is your chance to join us and make a huge impact as we continue the journey to become smarter and more efficient than ever before. Apply now! You know you want to…\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAndrew Ward\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/1359\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e79949957\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad87d"},"JobId":"80060947","ApplicationURL":"https://www.cwjobs.co.uk/job/80060947","Title":"Senior Developer","Description":"Senior Developer \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eCONTRACT - Senior .Net Developer - ASP.Net Core MVC, C#, Docker, AWS, Team City, Git, TDD\u003c/strong\u003e\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eFull Stack .Net Engineer needed to join our Tribe and work with one of our scrum teams to help us keep our customers happy, solve the challenges of continuous delivery in a rapidly growing platform whilst in an evolving marketplace. For us, teamwork is everything. We listen to each other, we adapt and we value honest feedback to help us keep on improving. We are making significant investment in DevOps at scale and we will invest in you.\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eOur Tech Stack/Tools\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eC#, .Net Core MVC, CSS/jQuery, react, SQL Server\u003c/li\u003e\u003cli\u003eTDD, Agile, pair programming\u003c/li\u003e\u003cli\u003eGitHub, Team City, Octopus CI/CD deploy pipeline\u003c/li\u003e\u003cli\u003eAWS, Terraform, Docker Containers, ECS\u003c/li\u003e\u003cli\u003eKibana, Grafana Dashboard and Exceptionless\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eA typical week as a developer might involve:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eStart your day with a stand up, then spin up your vm and bham, you're ready to go\u003c/li\u003e\u003cli\u003ePair with your team mates, write some tests and implement your app\u003c/li\u003e\u003cli\u003eRealise a team member has left their laptop unlocked and turn their screen upside down (unwritten rule - don't do this to your pairing partner)\u003c/li\u003e\u003cli\u003eReview a pull request and deploy to production through your CI pipeline - pat yourself on the back\u003c/li\u003e\u003cli\u003eCoffee and Table Tennis break in the morning, then pop to Borough Market for lunch or go to a “lunch \u0026amp; learn”\u003c/li\u003e\u003cli\u003eCome across a show stopper, figure out as a team what to do, run some whiteboard design sessions (realising you've used a permanent marker, you quickly leave the room)\u003c/li\u003e\u003cli\u003eDesign and experiment in your team retro on the roof terrace\u003c/li\u003e\u003cli\u003eMingle with peeps from other tribes at Innovation day demos with beers and snacks\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eWhat we’d like from you:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eBring your whole self to work\u003c/li\u003e\u003cli\u003eAbility and/or experience to mentor, guide and lead by example\u003c/li\u003e\u003cli\u003eSuper interested in all things technical\u003c/li\u003e\u003cli\u003eWilling to participate in and often lead technical discussion(s)\u003c/li\u003e\u003cli\u003eCommitment to high quality, maintainable code\u003c/li\u003e\u003cli\u003eHappy to collaborate with a wide group of stakeholders\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eCool stuff you’ll like:\u003c/strong\u003e\u003c/p\u003e\u003cul style=\"text-align: justify\"\u003e\u003cli\u003eWeekly exercise club\u003c/li\u003e\u003cli\u003e10th floor roof terrace with bar (yoga on a Monday, drinks on Thursday/Friday)\u003c/li\u003e\u003cli\u003eScrum team social budget for lunch and events\u003c/li\u003e\u003cli\u003eTribe events and socials\u003c/li\u003e\u003cli\u003eMonthly innovation day (work on whatever you like)\u003c/li\u003e\u003cli\u003eHackathons\u003c/li\u003e\u003cli\u003eFree nerf guns and ammo\u003c/li\u003e\u003cli\u003eAmazing location – Tate Modern, The Globe, Borough Market\u003c/li\u003e\u003cli\u003eSubsidised canteen with a view\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: justify\"\u003e\u003cstrong\u003eSo, why us?\u003c/strong\u003e\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eWe have a simple purpose – to enable job seekers and organisations to achieve greater success. Our people are helping 9 million job seekers to find their dream job every month. Our websites are visited nearly 18 million times per month with over 80 million page impressions. Our expert matching technology, and best in class UX drives over 5.2 million applications every month.\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eSince becoming part of the StepStone family, we’ve focussed on creating a unique and collaborative culture where we all share the same values and beliefs that makes Totaljobs Group an even better place to build your career. Our people are the key to our success and they have voted us to be a Great Place to Work for the past 10 years!\u003c/p\u003e\u003cp style=\"text-align: justify\"\u003eThis is your chance to join us and make a huge impact as we continue the journey to become smarter and more efficient than ever before. Apply now! You know you want to…\u003c/p\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAndrew Ward\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/1391\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80060947\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad87e"},"JobId":"79955042","ApplicationURL":"https://www.cwjobs.co.uk/job/79955042","Title":"Cloud Architect","Description":"Cloud Architect \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cul\u003e\u003cli\u003eGermany or UK based with frequent travel to Germany\u003c/li\u003e\u003cli\u003eRate 650 to 750 gbp per day\u003c/li\u003e\u003cli\u003eStart March 2018\u003c/li\u003e\u003cli\u003e6 month contract full time\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eOur global valued Telco client needs a Cloud Architect to design their Cloud environments with a focus on Azure and AWS.\u0026nbsp;\u003c/p\u003e\u003cp\u003eYou will demonstrate technical cloud Architecture knowledge playing a vital role in the design of production, staging, QA and development of Cloud Infrastructures running in 24x7 environments. The role will focus on delivery of our customers cloud strategies with a focus on Cloud Migrations.\u003c/p\u003e\u003cp\u003eYou will provide leadership in infrastructure migration methodologies and techniques including mass application movements into the cloud including implementation of Azure or AWS within large regulated enterprise environments. You will nurture Cloud computing expertise internally and externally to drive Cloud Adoption.\u003c/p\u003e\u003cp\u003eTo succeed\u003c/p\u003e\u003cul\u003e\u003cli\u003eAzure or AWS based Cloud Architecture and migration skills and experience.\u003c/li\u003e\u003cli\u003eStrong understanding across Cloud and infrastructure components (server, storage, network, data, and applications) to deliver end to end Cloud Infrastructure architectures and designs.\u003c/li\u003e\u003cli\u003eKnowledge of further Cloud technologies (Azure, S3, VMware)\u003c/li\u003e\u003cli\u003e4+ years' experience as an IT Infrastructure Architect, with focus on Azure, cloud, server, storage and networking.\u003c/li\u003e\u003cli\u003e10+ years' experience with MS Server Operating Systems\u003c/li\u003e\u003cli\u003e4+ years' experience with MS SQL, Sharepoint and .NET\u003c/li\u003e\u003cli\u003eExperience in leading a team applying all elements of Technical Consulting\u003c/li\u003e\u003cli\u003eExcellent communication \u0026amp; interpersonal skills\u003c/li\u003e\u003cli\u003eUnderstands and can articulate the technical merits and value of Cloud computing\u003c/li\u003e\u003cli\u003eExperience with “on-premise to cloud” migrations or IT transformations\u003c/li\u003e\u003cli\u003eExperience architecting/operating solutions build on AWS\u003c/li\u003e\u003cli\u003eExcellent communication skills with an ability to right level conversations\u003c/li\u003e\u003cli\u003ePresentation skills with a high degree of comfort speaking with executives, IT Management, and developers\u003c/li\u003e\u003cli\u003ePassionate, persuasive, articulate Cloud professional capable of quickly establishing interest and credibility in how to design, deploy and operate cloud based Architectures. Strong written, verbal and chalk board skills\u003c/li\u003e\u003cli\u003eExperience in working in Prince2 or PMI, Agile methodology managed projects is valued.\u003c/li\u003e\u003cli\u003eExperience in enterprise applications, solutions and data center infrastructures\u003c/li\u003e\u003c/ul\u003e\u003cspan\u003eGreat opportunity! Please APPLY NOW or connect with our Talent Acquisition Manager Bri Bell for more information.\u003c/span\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eBrianna Bell\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e79955042\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad87f"},"JobId":"80099959","ApplicationURL":"https://www.cwjobs.co.uk/job/80099959","Title":"Java Developer - ( eTrading / Ivestment Bank )","Description":"Java Developer - ( eTrading / Ivestment Bank ) \r\n    \u003cp\u003e\r\n        My client a world renown investment bank with a presence in over 70+ countries is seeking a Java Developer with experience in eTrading for a long term contract in London. \u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eDepartment overview\u003c/strong\u003e \u003cbr\u003e\u003cbr\u003eThe Credit IT division is responsible for the technology used by all areas of the global Credit business. Within Credit IT, the Credit ETS team is responsible for the design, development \u0026amp; maintenance of internal price distribution, aggregation and contribution of prices and orders to the markets. The asset classes covered on the eTrading platform are credit Bonds, FRNs, single-name CDS and index CDS.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eThe Credit ETS development team is based in London and New York. The platform is deployed globally in Europe, Americas and Asia; the London development team liaises with global support teams to ensure the stability and uptime of the platform.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eThe Credit business has identified eTrading as a key area in which they would like to develop in terms of reliability and functionality hence success in this area is regarded as essential to help the business succeed. \u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eJob Description \u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eMty client is seeking an experienced developer whose expertise is in Java primarily working on server side components. They will work on design and implementing features for Credit eTrading order management and market connectivity layers. This will include build out of bond quoting from an Algo Engine, enhancements to Bonds Auto Negotiation engine and the build out of an internal RFQ workflow between sales and trading.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eThe qualified applicant should possess experience with producing clean, high performance, scalable and testable applications, while demonstrating a great sense of design and attention to detail.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eCandidates must have front-office team experience and any knowledge of eTrading systems, ideally within Credit.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eRequired Skills and Qualifications \u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eExperience with Java 7.0+\u003cbr\u003e\u003cbr\u003eMust have experience with multi-threading programming\u003cbr\u003e\u003cbr\u003eExperience with asynchronous and event driven programming\u003cbr\u003e\u003cbr\u003eExperience developing real-time applications\u003cbr\u003e\u003cbr\u003eFamiliar with building distributed systems\u003cbr\u003e\u003cbr\u003eKnowledge of networks and topologies\u003cbr\u003e\u003cbr\u003eFirm grounding of common algorithms\u003cbr\u003e\u003cbr\u003eFamiliar working with LINUX environments\u003cbr\u003e\u003cbr\u003eFamiliar with Oracle / SQL Server\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eExcellent oral and written communication skills\u003cbr\u003e\u003cbr\u003eProactive team player with a \"can-do\" attitude\u003cbr\u003e\u003cbr\u003eExcellent analytical problem solver\u003cbr\u003e\u003cbr\u003eAttention to detail and thoroughness a must\u003cbr\u003e\u003cbr\u003eAbility to design and implement unit tests (with JUnit) and integrate into automated build process\u003cbr\u003e\u003cbr\u003eEnd-to-end ownership - ensure the code that you write is carried through to production\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eDesired Skills/Experience\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003eA working knowledge of Fixed Income instruments including Credit Default Swaps\u003cbr\u003e\u003cbr\u003eKnowledge of [ION] third party market data connectivity API\u003cbr\u003e\u003cbr\u003eExperience working in a Front office team\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAidan Mcneill\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/9834\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80099959\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad880"},"JobId":"80189142","ApplicationURL":"https://www.cwjobs.co.uk/job/80189142","Title":"DevOps Engineer","Description":"DevOps Engineer \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eDevOps Engineer – London\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLondon \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e6 months+\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eStart date ASAP\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOur client is a leading ecommerce business and due to continued success, they are urgently looking for an experienced DevOps Engineer to join their dynamic city-based team.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eResponsibilities:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eWorking directly with product development teams following DevOps best practices. Primarily focused on the build and deployment\u003c/li\u003e\u003cli\u003eof high quality software products into a range of environment\u003c/li\u003e\u003cli\u003eCollaboration, involved in design, build and maintenance of applications deployed onto the private cloud and public cloud hosting on\u003c/li\u003e\u003cli\u003eAWS\u003c/li\u003e\u003cli\u003eLiaise with global tech teams to remove impediments and diagnose/prevent incidents. Protection of large revenue generating systems\u003c/li\u003e\u003cli\u003eIdentify improvements in systems and processes, leading change in the interests of quality, productivity and supportability\u003c/li\u003e\u003cli\u003ePartake in an on-call rota, which may require working weekends (once established as part of the future product development strategy)\u003c/li\u003e\u003cli\u003eChampion security standards \u0026amp; best practices, collaborating with dedicated teams\u003c/li\u003e\u003cli\u003eStrong analytical and problem-solving skills with a high attention to detail\u003c/li\u003e\u003cli\u003eAn ability to learn new technologies and adopt new tools\u003c/li\u003e\u003cli\u003eExcellent interpersonal skills suited to a dynamic working environment\u003c/li\u003e\u003cli\u003eManage multiple priorities and communicate effectively with stakeholders\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan style=\"text-decoration: underline\"\u003eSkills required: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eSupport/Administration of Linux (RHEL) in an enterprise environment\u003c/li\u003e\u003cli\u003eExposure to AWS services (EC2, S3, ECS, ALB)\u003c/li\u003e\u003cli\u003eExposure to Configuration Management tools (Puppet)\u003c/li\u003e\u003cli\u003eKnowledge of containerisation technologies (Docker)\u003c/li\u003e\u003cli\u003eExperience of effective CI/CD environments and technologies (Jenkins, Marathon and Mesos).\u003c/li\u003e\u003cli\u003eFamiliar with Enterprise Java Web/Application Server technologies (e.g. Apache HTTPD 2.x, Apache Tomcat) and SQL DB tech Oracle and Non-\u003c/li\u003e\u003cli\u003eSQL such as Cassandra\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"text-decoration: underline\"\u003eDesirable skills: \u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eHas worked directly on production environments and supported large revenue generating systems for large ecommerce organizations\u003c/li\u003e\u003cli\u003eA flexible style\u003c/li\u003e\u003cli\u003eSomeone that can collaborate and work with a range of development skillsets but looks to challenge everyone to continually\u003c/li\u003e\u003cli\u003eimprove\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIf you are a DevOps Engineer looking for a challenging contract opportunity, then apply with your CV to this advert today\u003c/p\u003e\u003cp\u003eAWS // LINUX // PUPPET // DOCKER // CI/CD // SQL // JENKINS // \u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAmie-Jayne Hudson\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/JO-1801-14503a\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80189142\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad881"},"JobId":"80213133","ApplicationURL":"https://www.cwjobs.co.uk/job/80213133","Title":"Contract Java Developer","Description":"Contract Java Developer \r\n    \u003cp\u003e\r\n        Keytree is currently recruiting for a Contract Java Developer to join their award winning development team. As part of the role you will work as part of a dedicated project team collaborating with UI Developers, UI/UX Designers and Project Managers to ensure our projects are delivered on time and to spec.\u003cbr\u003e \u003cbr\u003e The ideal developer should have a solid background as a Java developer with experience preferably with Oracle. It’s essential that you are able to work collaboratively as well as autonomously when necessary.\u003cbr\u003e \u003cbr\u003e The role is based on site in our clients West London office.\u003cbr\u003e \u003cbr\u003e \u003cstrong\u003eEssential\u003c/strong\u003e\u003cbr\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eStrong core Java skills\u003c/li\u003e\u003cli\u003eExperience of development with J2EE\u003c/li\u003e\u003cli\u003eBasic Unix skills\u003c/li\u003e\u003cli\u003eStrong SQL skills preferably using Oracle\u003c/li\u003e\u003cli\u003eProven ability to understand and troubleshoot large systems, drilling down to code level to identify the root cause of issues\u003c/li\u003e\u003cli\u003eExperience with agile tools and methodologies (e.g. Scrum, Confluence, JIRA)\u003c/li\u003e\u003cli\u003eExcellent communication skills- written \u0026amp; oral\u003c/li\u003e\u003c/ul\u003e\u003cstrong\u003eDesirable\u003c/strong\u003e\u003cbr\u003e\u003cul\u003e\u003cli\u003eKnowledge of Spring Framework (3 and above) and a clear understanding of dependency injection\u003c/li\u003e\u003cli\u003eGood understanding of Hibernate/JPA and Object-relational mapping, including performance considerations\u003c/li\u003e\u003cli\u003eExperience with Maven and application development processes e.g. Continuous Integration\u003c/li\u003e\u003cli\u003eExperience integrating systems using a wide variety of protocols like REST, SOAP, MQ, TCP/IP, JSON and a number of others\u003c/li\u003e\u003c/ul\u003e\u003cstrong\u003eDirect applicants only - no agencies.\u003c/strong\u003e\u003cbr\u003e \u003cbr\u003e \u003cstrong\u003eCompany Information\u0026nbsp;\u003c/strong\u003e\u003cbr\u003e \u003cbr\u003e Keytree helps companies become leaner, faster and more agile with our award-winning team of SAP experts and beautifully designed applications. The way we work sets us apart. Our London-based, multi-disciplined teams are built on a foundation of communications and accountability. We are driven by innovation and a passion for design and great user experience.\u0026nbsp;\u003cbr\u003e \u003cbr\u003e At Keytree we work with our clients to understand their business goals and solve their problems using our technological and industry expertise.\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eCilla Thompson\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/KT- 228C\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80213133\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad882"},"JobId":"79859246","ApplicationURL":"https://www.cwjobs.co.uk/job/79859246","Title":"Senior C# / C++ Quantitative developer","Description":"Senior C# / C++ Quantitative developer \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eQuanteam Group is a Consulting firm specialised in the Capital Markets industry, in Paris, London, Brussels, New York and North Africa. \u003c/span\u003e\u003c/p\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eSince 2007, our 450 consultants provide major clients (Corporate \u0026amp; Investment Banks, Asset Managers, Hedge Funds, Brokers and Insurance Companies) with expertise in several projects such as Financial Engineering, Quantitative Research, Regulatory Implementation, IT Transformation \u0026amp; Innovation.\u003c/span\u003e\u003c/p\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eThe firm mainly takes part in:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli style=\"text-align: justify\"\u003e\u003cspan\u003eBusiness consulting: Quantitative research, Risk management (e.g. Market risk, credit risk, counterparty risk), Banking regulations (e.g. Basel III, Solvency II, FATCA, EMIR, MiFID), Pricing \u0026amp; Valuation, Organisational Transformation \u0026amp; Process Improvement.\u003c/span\u003e\u003c/li\u003e\u003cli style=\"text-align: justify\"\u003e\u003cspan\u003eIT \u0026amp; Information systems consulting: Business Analysis, Project Management, Change management, Front Office Support (functional and technical), Development (e.g C++, Python, C#, Java, VBA), Financial Softwares (e.g. Sophis, Murex, Summit, Calypso), IT Transformation \u0026amp; Innovation.\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eAs part of Quanteam Group, Quanteam UK (incorporated in 2010) has today more than 60 consultants, working for major Capital Markets players in London. \u003cbr\u003e\u003c/span\u003e\u003c/p\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003ePROJECTS\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cbr\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eQuanteam UK is currently working on various highly skilled projects, with several major Investment Banks in the City. \u003cbr\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn particular, we are looking to bring on board experienced Quantitative Developers with the following skills:\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eStrong C++ and/or C# programming background\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInvestment Banking Front Office / Quantitative Research experience is\u0026nbsp;\u003cu\u003erequired\u003c/u\u003e\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eA candidate with experience of C++ under Linux environment would be great but not mandatory\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eMicrosoft COM (Component Object Model) technology knowledge would be useful but is not a requirement \u003c/span\u003e\u003cspan\u003e(the client wishes to move from COM to Linux on the long run)\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eFinancial products knowledge is a plus, particularly on Fixed Income flow and derivatives products\u0026nbsp;\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp style=\"text-align: ?A\"\u003e\u003cspan\u003eThis is a long term opportunity (\u0026gt; 1 year minimum).\u003c/span\u003e\u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eRecruitment Team\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e79859246\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad883"},"JobId":"80245406","ApplicationURL":"https://www.cwjobs.co.uk/job/80245406","Title":"Business Analyst - Data Modelling, SQL, EDF","Description":"Business Analyst - Data Modelling, SQL, EDF \r\n    \u003cp\u003e\r\n        \u003cstrong\u003eBusiness Analyst - \u003c/strong\u003eContract, London, Data Modelling, SQL, EDF\u003cbr\u003e\u003cbr\u003eBusiness Analyst is urgently needed for a global Lloyds Insurer to work on their EDF Programme. This is an urgent hire and you will ideally need to available to start \u003cstrong\u003eimmediately\u003c/strong\u003e. You will be working within a team with the Lead Business Analyst and Data Analyst as they look to complete their EDF focused programme.\u003cbr\u003e\u003cbr\u003eYou will need to have hands on experience of dimensional modelling with the knowledge and experience to understand data. There will be a focus on technical ability for this position, so good Excel and SQL skills will be crucial for the successful candidate.\u003cbr\u003e\u003cbr\u003eThis is a great opportunity to work within the Lloyds Market for a global company. You will be expected to have experience in Business Analysis structuring methods as well as strong facilitation skills.\u003cbr\u003e\u003cbr\u003e \u003cstrong\u003eKey Skills: \u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eHands-on experience of dimensional modelling.\u003c/li\u003e\u003cli\u003eAbility to analyse and understand data.\u003c/li\u003e\u003cli\u003eAttention to detail and an understanding of approaches to testing data.\u003c/li\u003e\u003cli\u003eHands on experience with Excel and SQL \u003c/li\u003e\u003cli\u003eAny experience within insurance or the Lloyds insurance market would be highly beneficial\u003c/li\u003e\u003c/ul\u003e\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003e\u003cstrong\u003ePlease submit your CV for immediate review\u003c/strong\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eOliver Mutch\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/BBBH1913\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80245406\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad884"},"JobId":"80246186","ApplicationURL":"https://www.cwjobs.co.uk/job/80246186","Title":"Technical Consultant - C# - .NET - London - Contract","Description":"Technical Consultant - C# - .NET - London - Contract \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cp\u003e\u003cspan\u003eTechnical Consultant – C# - .NET – SQL – XML – London. 6 month contract.\u0026nbsp;\u003c/span\u003eAward winning data analytics and business intelligence solutions provider to financial and retail clients seeks to hire two .NET Technical Consultant for a large scale implementation project in London. The client is an award winning Microsoft partner and Consultancy Company who specialise in the finance and retail sectors providing real-time analytics solutions to blue-chip corporations.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe .NET Technical Consultant will:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eInvolved in many high profile projects providing solutions for major Blue chip clients\u003c/li\u003e\u003cli\u003eGathering requirements\u003c/li\u003e\u003cli\u003eDesign and development of solutions\u003c/li\u003e\u003cli\u003eSoftware deployment\u003c/li\u003e\u003cli\u003eMapping and transforming data\u003c/li\u003e\u003cli\u003eLiaise with internal and external development, testing and support departments\u003c/li\u003e\u003cli\u003eProviding documentation and knowledge to support teams\u003c/li\u003e\u003cli\u003eDevelopment work using Windows Workflows, C# and SQL Server\u003c/li\u003e\u003cli\u003eProblem solve client software issues\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eTechnical Consultant Skill Requirements: \u003c/p\u003e\u003cul\u003e\u003cli\u003eProven commercial .NET Development experience\u003c/li\u003e\u003cli\u003eExperience working within technical consultancy, software implementation, software integration\u003c/li\u003e\u003cli\u003eExperience working directly with clients\u003c/li\u003e\u003cli\u003e.NET C# experience\u003c/li\u003e\u003cli\u003eSQL Server – T-SQL experience\u003c/li\u003e\u003cli\u003eXML, XSLT experience\u003c/li\u003e\u003cli\u003eCloud Services – Azure or AWS - desirable\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe Technical Consultant is required for 6 months with strong potential for extension after this period. Technical Consultant with Finance or Retail experience is highly advantageous.\u0026nbsp;\u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eJoseph Miller\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/JM4029\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80246186\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad885"},"JobId":"80246662","ApplicationURL":"https://www.cwjobs.co.uk/job/80246662","Title":"SDET/Test Automation Consultant - C#/Specflow/Swagger/RESTful API's","Description":"SDET/Test Automation Consultant - C#/Specflow/Swagger/RESTful API's \r\n    \u003cp\u003e\r\n        \u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cu\u003e\u003cstrong\u003eSDET/Test Automation Consultant - C#/Specflow/Swagger/RESTful API's - £450 - £550 per day\u003c/strong\u003e\u003c/u\u003e\u003c/p\u003e\u003cp\u003eSDET/Test Automation Engineer required by one of the world's largest E-commerce retailers to work on a large integration programme.\u003c/p\u003e\u003cp\u003eMy client is looking for a strong SDET/Test Automation Engineer who has experience of developing automation frameworks from scratch in C#.\u003c/p\u003e\u003cp\u003eYou should also have experience using tools such as Specflow (or similar) as well as experience with restFUL APis.\u003c/p\u003e\u003cp\u003eMy client is a very high volume, high traffic eCommerce firm with a strong reputation for innovation.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eKey skills for this contract include:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e- Strong experience as an SDET/Test Automation Consultant\u003c/p\u003e\u003cp\u003e- Experience of building fameworks in C#\u003c/p\u003e\u003cp\u003e- Specflow/Swagger experience \u003c/p\u003e\u003cp\u003e- RESTful API's\u003c/p\u003e\u003cp\u003eThis contract is based in Luton for an initial 6 months and offers a daily rate between £450-£500 per day.\u003c/p\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eAndrew Shaw\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/TE/878970809\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80246662\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad886"},"JobId":"80247176","ApplicationURL":"https://www.cwjobs.co.uk/job/80247176","Title":"C# Developer","Description":"C# Developer \r\n    \u003cp\u003e\r\n        My blockchain client is currently seeking a number of C# developers to join their growing team - This is an opportunity to be involved in the crypto currencies world and for a market leader, these opportunities are very few and far between.\u003cbr\u003e\u003cbr\u003eThe engineer will be someone who:\u003cbr\u003e\u003cbr\u003e- Is passionate about blockchain\u003cbr\u003e - Is a strong C# developer\u003cbr\u003e - Likes to work as part of a team\u003cbr\u003e - Wants to build industry-changing blockchain products\u003cbr\u003e - Can take ownership from the get-go and work with minimal guidance\u003cbr\u003e - Financial Services - Banking experience \u003cbr\u003e - 5+ years experience shipping production code\u003cbr\u003e - Experience working with open source code, including using open source code\u003cbr\u003e - Agile methodologies\u003cbr\u003e - Algorithms and OOP concepts\u003cbr\u003e\u003cbr\u003eDesirable but not essential\u003cbr\u003e\u003cbr\u003e- Experience with Microsoft Azure\u003cbr\u003e - Familiarity with cryptographic concepts\u003cbr\u003e - Understanding of the Bitcoin blockchain\u003cbr\u003e - Understanding of Hyperledger\u003cbr\u003e - ASP.NET MVC\u003cbr\u003e\u003cbr\u003ePlease apply with an up to date resume for immediate consideration.\u003cbr\u003e\u003cbr\u003eAllegis Group Limited and Aston Carter Limited operate Employment Businesses and Agencies and are companies within the Allegis Group Inc. group of companies, the fourth largest staffing company in the world, (collectively referred to as the \"Allegis Group\"). TEKsystems and Aerotek are divisions of Allegis Group Limited. Applicant data will be treated in accordance with the Allegis Group's Privacy Notice http://www.allegisgroup.com/Privacy/Default.aspx). By submitting personal data to any company or division within the Allegis Group, the applicant is providing explicit consent to the use of such data by the Allegis Group and to the transfer of such data to and from the Allegis Group companies within the UK, Europe and outside the European Economic Area in connection with the fulfilment of the applicant's voluntary requests, and the fulfilment of other job opportunities that match the applicant's profile, and confirms that they may be contacted about such job opportunities.\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eMelissa Usher\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/270218\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80247176\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad887"},"JobId":"80189212","ApplicationURL":"https://www.cwjobs.co.uk/job/80189212","Title":"Analyst Developer / MI / Lloyds Insurance / Contract","Description":"Analyst Developer / MI / Lloyds Insurance / Contract \r\n    \u003cp\u003e\r\n        \u003c/p\u003e\u003cdiv\u003e\u003cspan\u003e\u003cspan\u003e\u003cb\u003eAnalyst Developer / MI / Lloyds Insurance / Contract\u003c/b\u003e\u003c/span\u003e\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e6 month contract with likely extension\u003c/div\u003e\u003cdiv\u003e\u003cspan\u003e\u003cspan\u003eImmediate start\u003c/span\u003e\u003c/span\u003e\u003c/div\u003e\u003cdiv\u003eLloyds Insurance experience essential !\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eRole requirements\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e·Analysis of reporting requirements and experience in design of database and SSAS cube\u003c/p\u003e\u003cp\u003e·Development of ETL using SQL and SSIS to load a database that will be the source of cube data\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eDevelopment of an SSAS cube to make data available for analysis\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eData profiling and analysis in support of business analysts\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eStrong SSIS, SSAS and SQL skills\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eCo-ordinate with development team, adhering to standards\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eAddress testing defects and be able to provide development support to business testing \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eEssential: \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eLloyd’s market Insurance and\\or Reinsurance experience min 3 years\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eMicrosoft BI Stack Developer (SSIS\\SSAS\\ SSRS) min 5 years \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eData Warehouse experience min 5 years\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDesirable: \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eExperience developing Microsoft SQL Server 2016 or later\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eC#\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e·\u003c/span\u003e\u003cspan\u003eExperience with Analytics Tools such as Pyramid, Tableau \u003c/span\u003e\u003c/p\u003e\u003cp\u003e·Finance experience\u003c/p\u003e\u003cp\u003e\u003cb\u003eAnalyst Developer / MI / Lloyds Insurance / Contract\u003c/b\u003e\u003c/p\u003e\u003c/div\u003e\r\n    \u003cp\u003e\u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eJ-P Anquetil\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80189212\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
{"_id":{"$oid":"5a95959c6c00361b443ad888"},"JobId":"80248027","ApplicationURL":"https://www.cwjobs.co.uk/job/80248027","Title":"Solutions Architect","Description":"Solutions Architect \r\n    \u003cp\u003e\r\n        Solutions Architect | £500 per day | Central London\u003cbr\u003e\u003cbr\u003eMy client, a telecommunications company in Central London, are currently looking for a Solutions Architect for a 9 month period (minimum).\u003cbr\u003e\u003cbr\u003eThe responsibilities of this role will include:\u003cbr\u003e\u003cbr\u003e- Implementing serviceNow\u003cbr\u003e- Integrating serviceNow with internal systems such as SAP and Cognos\u003cbr\u003e- Implementing the strategy and providing insight into the applications and options for migration to cloud platforms\u003cbr\u003e- Manging third party supplier relationships\u003cbr\u003e\u003cbr\u003eThe ideal candidate will have the following knowledge/ experience:\u003cbr\u003e\u003cbr\u003e- Experience of implementing serivceNow\u003cbr\u003e- Strong technical background - SQL, Linux, AWS, data warehousing, Docker, Hadoop\u003cbr\u003e- Experience of a wide range of methodologies - Waterfall/ Agile\u003cbr\u003e\u003cbr\u003eIf you are interested in this role then please do get in touch.\r\n    \u003c/p\u003e\r\n    \u003cul class=\"contact-reference hidden-xs\"\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eContact: \u003c/span\u003eNeil Fuller\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eReference: \u003c/span\u003eCWJobs/SA123\r\n        \u003c/li\u003e\r\n        \u003cli\u003e\r\n            \u003cspan class=\"reference\"\u003eJob ID: \u003c/span\u003e80248027\r\n        \u003c/li\u003e\r\n    \u003c/ul\u003e\r\n   \r\n","CreatedAt":"2018-02-27 172935"}
