{"_id":{"$oid":"5a8ec03b6c003622ec4fa175"},"JobId":"09B4B2E5BD4AD150","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=09B4B2E5BD4AD150","Title":"Salesforce Consultant - Contract (Contract)","Description":"Salesforce Consultant - Contract (Contract) \u003cp\u003eOur Client is looking for a Salesforce Cloud Consultant to join their team on a six-month initial contract. The Salesforce Cloud Consultant will be responsible for configuring and delivering world-class CRM solutions for customers, producing enterprise standard technology product and for working with the delivery teams to build and deliver them successfully on the Salesforce platform.\u003c/p\u003e \u003cp\u003eYou will be working for a growing organization who have a huge amount of career opportunities. There is a very collaborative environment both within the team and across functions.\u003c/p\u003e \u003cp\u003ePrimary responsibilities include:\u003c/p\u003e \u003cul\u003e \u003cli\u003eConfiguration and customisation of the Platform\u003c/li\u003e \u003cli\u003eStrong configuration experience - workflows, apex triggers, validation rules and process flows\u003c/li\u003e \u003cli\u003eUnderstanding of Apex code (No hands-on coding needed)\u003c/li\u003e \u003cli\u003eProvide Subject Matter Expertise in Cloud Architecture\u003c/li\u003e \u003cli\u003ePerform root cause analysis and troubleshoot systems \u0026amp; interfaces\u003c/li\u003e \u003cli\u003eUser adoption and training\u003c/li\u003e \u003cli\u003eConduct and lead requirement gathering sessions\u003c/li\u003e \u003cli\u003eAuthoring functional/technical design documents\u003c/li\u003e \u003cli\u003eManaging the technical delivery of integrations and custom extensions\u003c/li\u003e \u003cli\u003eProviding hands on expert level assistance to developers on technical issues\u003c/li\u003e \u003cli\u003eGood implementation experience - Service and Sales cloud\u003c/li\u003e \u003cli\u003eCreating reports and dashboards\u003c/li\u003e \u003cli\u003eLiaise closely with the technical teams\u003c/li\u003e \u003cli\u003eGood communication skills\u003c/li\u003e \u003c/ul\u003e \u003cp\u003eRequirements:\u003c/p\u003e \u003cul\u003e \u003cli\u003eExperience of working in a faced paced environment\u003c/li\u003e \u003cli\u003eExtensive hands-on experience with Salesforce Cloud\u003c/li\u003e \u003cli\u003eIntegration experience\u003c/li\u003e \u003cli\u003eStrong API Skills and SQL\u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIf you able to work freely within the UK and would like to discuss this in more detail, then please apply here.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JSDP/UK-44100\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e DANEM PEOPLE Technical Recruitment Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Kevin Meyer","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa176"},"JobId":"D9A06E65F5961560","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=D9A06E65F5961560","Title":"Excel VBA Developer/Consultant (Contract)","Description":"Excel VBA Developer/Consultant (Contract) \u003cp\u003e An exclusive role and a fantastic opportunity with one of our clients. \u003c/p\u003e \u003cp\u003e\u003cstrong\u003e Technical skills required for this role: \u003c/strong\u003e \u003c/p\u003e \u003cp\u003e - MS Excel Expert - Familiar with the Excel Object Model. \u003c/p\u003e \u003cp\u003e - Experience with MS SQL Server \u003c/p\u003e \u003cp\u003e - Experience with writing advanced VBA \u003c/p\u003e \u003cp\u003e - Experience working in a Rapid Application Development (RAD) team \u003c/p\u003e \u003cp\u003e - Experience with 3rd party libraries such as Bloomberg, Reuters \u003c/p\u003e \u003cp\u003e - Understands the nuances of Excel versions between 2003 - 2016 \u003c/p\u003e \u003cp\u003e\u003cstrong\u003e The following experience/skill-set is desired to be successful: \u003c/strong\u003e \u003c/p\u003e \u003cp\u003e - Problem solver, comfortable taking the initiative in challenging and ambiguous circumstances \u003c/p\u003e \u003cp\u003e - Systematic approach to both support and development \u003c/p\u003e \u003cp\u003e - Friendly, approachable and collaborative team player who enjoys working with people from across the firm \u003c/p\u003e \u003cp\u003e - Continuous improvement mind-set, challenges the status quo and seeks self improvement \u003c/p\u003e \u003cp\u003e - Capable of remaining positive when under pressure \u003c/p\u003e \u003cp\u003e - Excellent technical and investigatory analysis skills. \u003c/p\u003e \u003cp\u003e This is an initial 6-month contract with likelihood of extension. Our client, a Large financial institution based in Central London, is embarking on a large-scale MS Office migration.\u003c/p\u003e \u003cp\u003e The primary role will be testing the integrity of existing Excel spreadsheets to make sure they are compliant based on the company's internal EUC policy and ensure all business-critical files are compatible in office 2016. The individual will need the skills to be able to remediate any compatibility issues or poorly designed/built spreadsheets. \u003c/p\u003e \u003cp\u003e You will be working with the internal IT teams as well as the end users. Whilst remediating spreadsheets, you will need to be able to develop tactical spreadsheet solutions that will be used as prototypes prior to the firm developing internally developed solutions. There may also be requests for ad-hoc spreadsheet automation. \u003c/p\u003e \u003cp\u003e Proprietary tools will be provided to analyse the spreadsheets and overall usage behaviour to improve the migration process. \u003c/p\u003e \u003cp\u003e\u003cstrong\u003e Please send your CV if you are interested in the role. \u003c/strong\u003e \u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JSVB-O-MIGRATION.02.02\u0026nbsp;\u003cstrong\u003eCompany:\u003c/strong\u003e HUB85\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e HUB85","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa177"},"JobId":"C0A8BA329C6019B3","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=C0A8BA329C6019B3","Title":"Application Developer (Contract)","Description":"Application Developer (Contract) \u003cp\u003e\u003cstrong\u003eApplication Developer (.Net) \u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eWembley, West London\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003e£250-300 Per day\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003e6-9-month contract \u003c/strong\u003e\u003c/p\u003e \u003cp\u003eOur client a large technology provider is looking for a contract Software Developer to join their head office in the UK.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eResponsibilities \u003c/strong\u003e\u003c/p\u003e \u003cul\u003e \u003cli\u003eResponsible for development, maintenance, and enhancement of business applications\u003c/li\u003e \u003cli\u003eCollaborate with stakeholders to identify user requirements, assess available technologies, and recommend solution options\u003c/li\u003e \u003cli\u003eAssesses objectives for assigned project phases and recommends technical strategies and tactics to achieve business needs\u003c/li\u003e \u003cli\u003eDeveloping new applications and services using C# with emphasis on File I/O, Winforms, Win Services, WCF, LINQ and Entity Framework\u003c/li\u003e \u003cli\u003eWriting installation packages in InstallShield\u003c/li\u003e \u003cli\u003eExploring requirements and writing use case/user stories\u003c/li\u003e \u003cli\u003eRun unit testing and write code documentation\u003c/li\u003e \u003c/ul\u003e \u003cp\u003e\u003cstrong\u003eEssentials \u003c/strong\u003e\u003c/p\u003e \u003cul\u003e \u003cli\u003eExperience in Agile methodology\u003c/li\u003e \u003cli\u003eDeveloping reports in Visual Studio Integrated Environment Crystal Reports\u003c/li\u003e \u003cli\u003eDatabase design and development using MS-SQL\u003c/li\u003e \u003cli\u003eUnderstanding of SOA and implementation of service-based systems\u003c/li\u003e \u003cli\u003eDemonstrated communication skills with Development and Program Managers to develop technical specifications for application code\u003c/li\u003e \u003c/ul\u003e \u003cp\u003e\u003cstrong\u003eIf you are interested in this great opportunity, please do send your CV to (see below) \u003c/strong\u003e\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e 83Zero Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e sophie ellis","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa178"},"JobId":"1A4561DC0AB3BEBD","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=1A4561DC0AB3BEBD","Title":"C# Azure Powershell Developer - City (Contract)","Description":"C# Azure Powershell Developer - City (Contract) \u003cp\u003eC#/Azure/Powershell/ARM/DSC/.NET/React/JSON/Jenkins/API builds/TFS deployments/Git/£500-£600 City of London - Global Insurance\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eStrong skills in all the above, plus:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e2 years FS\u003c/li\u003e\u003cli\u003e7 years + .NET development \u003c/li\u003e\u003cli\u003e2 years cloud based \u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eIf you meet all of the above - please apply, if you don't - please don't\u003c/strong\u003e\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-AZUREDEVOPSDEV\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e i3 Resourcing\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Tom White","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa179"},"JobId":"DAC66323AAF44C1C","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=DAC66323AAF44C1C","Title":"Angular Developer - Backbone JS - Central London (Contract)","Description":"Angular Developer - Backbone JS - Central London (Contract) \u003cp\u003e\u003cstrong\u003eAngular Developer - Backbone JS - Central London\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAngular JS Developer r\u003c/strong\u003eequired for a leading client based in Central London. My client is looking for an enthusiastic developer, with extensive Angular JS experience, to come on board to deliver Front End development.\u003c/p\u003e\u003cp\u003eYou will work on the full life cycle development of advanced cloud-based systems, from brainstorming and technical design through to architecting, programming and unit testing. This is an opportunity to actively contribute new ideas, tools, and methodologies to our design and development process.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSkills required,\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eExtensive Angular JS development experience\u003c/li\u003e\u003cli\u003eFront End development JavaScript, JQuery, Bootstrap3 and CSS\u003c/li\u003e\u003cli\u003eExcellent knowledge of Angular JS, C#, ASP.NET (3.5, 4, 4.5), MVC framework, Web API\u003c/li\u003e\u003cli\u003eFamiliarity with tools and techniques such as continuous integration and automated testing\u003c/li\u003e\u003cli\u003eStrong Front End Development skills\u003c/li\u003e\u003cli\u003eHTML/CSS/JavaScript experience\u003c/li\u003e\u003cli\u003eBackground in demonstrating technologies and guiding teams\u003c/li\u003e\u003cli\u003eBackbone JS experience is highly desirable\u003c/li\u003e\u003cli\u003eClear verbal and written communication skills\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eInterested!?! Send your up to date CV to Vicki Smith at Crimson for immediate review\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNot interested?! Do you know anyone that might be? Refer a friend for this role to earn £250 worth of vouchers. \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eCrimson are acting as an employment business in regards to this vacancy.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-CR/CR/008754\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Crimson Limited\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Victoria Smith","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa17a"},"JobId":"DE08811796260EB0","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=DE08811796260EB0","Title":"Market Risk Data Analyst (Contract)","Description":"Market Risk Data Analyst (Contract) \u003cp\u003eJob Title: \u003cstrong\u003eMarket Risk Data Analyst\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eLocation: \u003cstrong\u003eLondon, UK\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eDuration: \u003cstrong\u003e6 months+\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eStart Date: \u003cstrong\u003eImmediate\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eDaily Rate: \u003cstrong\u003e£350 to £400 per day\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eExperience: \u003cstrong\u003eMinimum 8 years of experience.\u003c/strong\u003e\u003cbr\u003e \u003cbr\u003e \u003cstrong\u003eKey Accountabilities:\u003c/strong\u003e\u003cbr\u003eRefining the logical design so it can be translated to the data model\u003cbr\u003e Provide technical and functional knowledge to support other staff members within the organization\u003cbr\u003e Interact with internal/external team members throughout the application life cycle\u003cbr\u003e Gather and document business requirements from business users as necessary.\u003cbr\u003e Manage builds and migrations between various staging environments\u003cbr\u003e Monitor and maintain application security and integrity\u003cbr\u003e Tune and monitor reporting application performance\u003cbr\u003e Maintain code automated SQL Pipeline build process\u003cbr\u003e Manage code within Team Foundation Server source control system\u003cbr\u003e 3rd line support of production systems including analysis and troubleshooting of problems\u003cbr\u003e Assist with release or change management process \u003cbr\u003e Document and provide knowledge transition to other team members\u003cbr\u003e \u003cbr\u003e \u003cstrong\u003eEssential Experience:\u003c/strong\u003e\u003cbr\u003e Reporting and data analysis skills\u003cbr\u003e Data Mappings\u003cbr\u003e MS SQL Server or Oracle databases\u003cbr\u003e ETL (Informatica or SSIS)\u003cbr\u003e Microsoft SSAS and/or reporting tools (SSRS, Power BI, Business Objects)\u003cbr\u003e Cloudera Data Lake (Impala, Hive, Hadoop)\u003cbr\u003e Experience working in an Agile teams\u003cbr\u003e Background in creating design documentation (eg data catalog)\u003cbr\u003e Effective and clear communicator \u003cbr\u003e High self-motivation and strong delivery focus\u003cbr\u003e Intellectual curiosity, creativity and passion for professional software development.\u003cbr\u003e Experience with programs of work migrating Data Analytics/Reporting platform to the Big Data solutions\u003cbr\u003e Experience with large-scale enterprise wide IT environments containing multiple technologies, Servers and logical environments \u003cbr\u003e Demonstrates evidence of project completion including transition to support in an enterprise environment \u003cbr\u003e Experience with enterprise project life cycle \u003cbr\u003e Experience with Change and Release Management\u003cbr\u003e Application of best practices to ensure quality and accuracy of project deliverables \u003cbr\u003e\u003cbr\u003e \u003cstrong\u003eDesirable criteria \u0026amp; qualifications\u003c/strong\u003e \u003cbr\u003e Understanding of Commodities (Oil, Gas, Power, LNG) finance\u003cbr\u003e Knowledge of end-to-end (Front to Back Office) business processes in financial trading \u0026amp; risk environment.\u003cbr\u003e Understanding of Datamodelling and data Warehousing principles \u003cbr\u003e Database unit-test and integration test experience with automated testing frameworks and tools such as SpecFlow and tSQLt\u003cbr\u003e Experience with Data Warehousing and Business Intelligence/Analysis tooling (SSAS, SSRS)\u003cbr\u003e Experience with Informatica's Big Data Manager and Intelligent Data Lake\u003cbr\u003e Understanding of other Big Data tools and technologies (eg Python, Spark, Sqoop)\u003cbr\u003e Working in the Cloud environment (AWS or Azure)\u003cbr\u003e Understand Service Oriented Architectures, Web Services, and Design Patterns\u003cbr\u003e Experience with software development life cycle (SDLC), Agile (SCRUM) processes, and source control and build tools (TFS, Clearcase, Subversion, Jenkins, Nant, Ant, Maven).\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eIf you are interested, please provide a copy of your latest CV ASAP\u003c/strong\u003e\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JSMC/22.02.18/MRDATA/UK\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e G \u0026amp; L Consulting\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Mario Clark","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa17b"},"JobId":"0E001E8CA204A54F","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=0E001E8CA204A54F","Title":"Market Risk Data Analyst (Contract)","Description":"Market Risk Data Analyst (Contract) \u003cp\u003eJob Greeting!\u003c/p\u003e \u003cp\u003eWe are looking for to hire \u003cstrong\u003eMarket Risk Data Analyst \u003c/strong\u003efor a Contractual Role in London, UK!\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eRole: Market Risk Data Analyst\u003c/strong\u003e\u003cbr\u003e\u003cstrong\u003eLocation: London, UK\u003c/strong\u003e\u003cbr\u003e\u003cstrong\u003eDuration of contract: 6 months\u003c/strong\u003e\u003cbr\u003e\u003cstrong\u003eRequired start date: Immediately\u003c/strong\u003e\u003cbr\u003e\u003cstrong\u003eVendor Rate: up to 400 GBP Per Day \u003c/strong\u003e\u003cbr\u003e\u003cstrong\u003eExperiences: Greater than 8 years of experience.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eKey Accountabilities:\u003c/p\u003e \u003cp\u003e Refining the logical design so it can be translated to the data model\u003cbr\u003e Provide technical and functional knowledge to support other staff members within the organization\u003cbr\u003e Interact with internal/external team members throughout the application life cycle\u003cbr\u003e Gather and document business requirements from business users as necessary.\u003cbr\u003e Manage builds and migrations between various staging environments\u003cbr\u003e Monitor and maintain application security and integrity\u003cbr\u003e Tune and monitor reporting application performance\u003cbr\u003e Maintain code automated SQL Pipeline build process\u003cbr\u003e Manage code within Team Foundation Server source control system\u003cbr\u003e 3rd line support of production systems including analysis and troubleshooting of problems\u003cbr\u003e Assist with release or change management process \u003cbr\u003e Document and provide knowledge transition to other team members\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eEssential Experience:\u003c/strong\u003e\u003cbr\u003e Reporting and data analysis skills\u003cbr\u003e Data Mappings\u003cbr\u003e MS SQL Server or Oracle databases\u003cbr\u003e ETL (Informatica or SSIS)\u003cbr\u003e Microsoft SSAS and/or reporting tools (SSRS, Power BI, Business Objects)\u003cbr\u003e Cloudera Data Lake (Impala, Hive, Hadoop)\u003cbr\u003e Experience working in an Agile teams\u003cbr\u003e Background in creating design documentation (eg data catalog)\u003cbr\u003e Effective and clear communicator \u003cbr\u003e High self-motivation and strong delivery focus\u003cbr\u003e Intellectual curiosity, creativity and passion for professional software development.\u003cbr\u003e Experience with programs of work migrating Data Analytics/Reporting platform to the Big Data solutions\u003cbr\u003e Experience with large-scale enterprise wide IT environments containing multiple technologies, Servers and logical environments \u003cbr\u003e Demonstrates evidence of project completion including transition to support in an enterprise environment \u003cbr\u003e Experience with enterprise project life cycle \u003cbr\u003e Experience with Change and Release Management\u003cbr\u003e Application of best practices to ensure quality and accuracy of project deliverables\u003c/p\u003e \u003cp\u003eDesirable criteria \u0026amp; qualifications \u003cbr\u003e Understanding of Commodities (Oil, Gas, Power, LNG) finance\u003cbr\u003e Knowledge of end-to-end (Front to Back Office) business processes in financial trading \u0026amp; risk environment.\u003cbr\u003e Understanding of Datamodelling and data Warehousing principles \u003cbr\u003e Database unit-test and integration test experience with automated testing frameworks and tools such as SpecFlow and tSQLt\u003cbr\u003e Experience with Data Warehousing and Business Intelligence/Analysis tooling (SSAS, SSRS)\u003cbr\u003e Experience with Informatica's Big Data Manager and Intelligent Data Lake\u003cbr\u003e Understanding of other Big Data tools and technologies (eg Python, Spark, Sqoop)\u003cbr\u003e Working in the Cloud environment (AWS or Azure)\u003cbr\u003e Understand Service Oriented Architectures, Web Services, and Design Patterns\u003cbr\u003e Experience with software development life cycle (SDLC), Agile (SCRUM) processes, and source control and build tools (TFS, Clearcase, Subversion, Jenkins, Nant, Ant, Maven).\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JSMARKETRISKDATAANALYST22022018\u0026nbsp;\u003cstrong\u003eCompany:\u003c/strong\u003e iXceed Solutions\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Shant","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa17c"},"JobId":"AB91CA6CF7BBC1AC","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=AB91CA6CF7BBC1AC","Title":"SDET/Automation Engineer/QA - C#.NET W.London £400 - 500 (Contract)","Description":"SDET/Automation Engineer/QA - C#.NET W.London £400 - 500 (Contract) \u003cp\u003eSDET/Automation Engineer/QA - C#.NET - £500pd\u003c/p\u003e\u003cp\u003eC#/.NET/Azure/CI/CD/SQL/Selenium/BDD/API/Cucumber/Specflow \u003c/p\u003e\u003cp\u003eA SDET is required for one of the leading software houses based in Central London. The appropriate candidate will be taking part in the development process of the company's existing and new products.\u003c/p\u003e\u003cp\u003eYou will be joining a motivated and innovative team of experts to create next generation financial assets software.\u003c/p\u003e\u003cp\u003e The core skills they desire are:\u003c/p\u003e\u003cul\u003e\u003cli\u003eExpert knowledge of automated functional/behavioural testing frameworks, which must include Selenium (beyond IDE)\u003c/li\u003e\u003cli\u003eC#/.NET/Azure\u003c/li\u003e\u003cli\u003eExtensive experience working in a software engineering/high quality software development\u003c/li\u003e\u003cli\u003eA good understanding of design patterns and Object Orientated software development\u003c/li\u003e\u003cli\u003eDeep understanding of modern automated software testing\u003c/li\u003e\u003cli\u003ePassion about software quality\u003c/li\u003e\u003cli\u003eThe ability to review Unit Testing and the quality and coverage of testing for back \u0026amp; Front End development\u003c/li\u003e\u003cli\u003eAPI testing\u003c/li\u003e\u003cli\u003eCucumber\u003c/li\u003e\u003cli\u003eSpecflow\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e If this role has piqued an interest, please apply ASAP as this is an urgent requirement for this client! \u003c/p\u003e\u003cp\u003e Please don't hesitate to contact me directly. \u003c/p\u003e\u003cp\u003eC#/.NET/Azure/CI/CD/SQL/Selenium/BDD/API/Cucumber/Specflow \u003c/p\u003e\u003cp\u003eSDET/Automation Engineer/QA - C#.NET - £500pd\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-AIIO\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Gravitas Recruitment Group Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Guy Bevington","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa17d"},"JobId":"6FCABE99E3902D4D","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=6FCABE99E3902D4D","Title":"ElasticSearch .NET Developer (Contract)","Description":"ElasticSearch .NET Developer (Contract) \u003cp\u003e\u003cstrong\u003eELASTICSEARCH - .NET - DEVELOPER - PROGRAMMER - SOFTWARE ENGINEER - C# - ASP.NET - HTML - MVC - LONDON - CONTRACT\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eElasticSearch .NET Developer is required on an initial 6 month contract in Covent Garden, London starting in February.\u003c/p\u003e\u003cp\u003eThis is an exciting opportunity for someone who can work within an Agile Methodology, loves working with new tech and enjoys problem solving. You will be involved in the full development life cycle, all the way from inception to delivery!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eKey skills and Responsibilities include: \u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eELASTICSEARCH\u003c/li\u003e\u003cli\u003e.NET\u003c/li\u003e\u003cli\u003eC#\u003c/li\u003e\u003cli\u003eASP.NET\u003c/li\u003e\u003cli\u003eMVC\u003c/li\u003e\u003cli\u003eHTML/CSS\u003c/li\u003e\u003cli\u003eSOLID principles \u003c/li\u003e\u003cli\u003eSCRUM \u003c/li\u003e\u003c/ul\u003e\u003cp\u003eDevelop the full life cycle of enterprise systems in C#, .NET using SOLID principles as well as maintaining and improving existing codebase.\u003c/p\u003e\u003cp\u003eIf the above role sounds of interest and you are keen to work in a nationally recognised recruitment agency, then please apply with a copy of your latest CV. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eELASTICSEARCH - .NET - DEVELOPER - PROGRAMMER - SOFTWARE ENGINEER - C# - ASP.NET - HTML - MVC - LONDON - CONTRACT \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eReed Specialist Recruitment is an Employment Agency and an Employment Business for permanent and temporary recruitment. In response to your application Reed will contact you by phone, email or SMS to discuss it. You can opt out at any time using the links provided. \u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-62975\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Reed Technology\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Rameen Hasan","CreatedAt":"2018-02-22 130517"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa17e"},"JobId":"D5DD13DF75AD9CDB","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=D5DD13DF75AD9CDB","Title":"Data Migration Analyst - Contract (Contract)","Description":"Data Migration Analyst - Contract (Contract) \u003cp\u003e\u003cstrong\u003eJob Title: Data Migration Analyst - Contract\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLocation: \u003c/strong\u003e\u003cstrong\u003eLondon\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSalary: \u003c/strong\u003e\u003cstrong\u003e£300-£400 per day\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAbout The Company looking for a Data Migration Analyst:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eMy client has a unique opportunity for a skilled and knowledgeable Data Migration Analyst to join their team in a 6 month contract position (with possibility for extension). The company works within the Public Sector and they are looking for a Data Analyst contractor to assist in their large-scale data migration project. If you are looking to add valuable experience to your portfolio as a Data Migration Analyst then this is the ideal position for you.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAbout The \u003c/strong\u003e\u003cstrong\u003eData Migration Analyst \u003c/strong\u003e\u003cstrong\u003eRole:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAs a Data Migration Analyst, you will be utilising ETL processes to integrate large amounts of data from various sources into a newly-constructed data warehouse. \u003c/p\u003e\u003cp\u003eYour \u003cstrong\u003eKey Responsibilities \u003c/strong\u003ewill be\u003cstrong\u003e:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eCreate a comprehensive migration strategy document that adheres to business requirements\u003c/li\u003e\u003cli\u003eExtract data from several platforms using ETL tools\u003c/li\u003e\u003cli\u003eRun tests to ensure the quality of data is not compromised during the transformation process\u003c/li\u003e\u003cli\u003eCreate detailed specifications of data mapping and transformation procedures\u003c/li\u003e\u003cli\u003eEffectively load data into DWH and utilise data cleansing techniques to eliminate errors\u003c/li\u003e\u003cli\u003eEnsure all data policies comply with GDPR guidelines\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eAbout The Successful Data Migration Analyst:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe successful Data Migration Analyst will not only be technically skilled but will have the ability to communicate their processes to non-technical colleagues. \u003c/p\u003e\u003cp\u003eThe \u003cstrong\u003eDesired Skills and Competencies of the Data Migration Analyst \u003c/strong\u003eare\u003cstrong\u003e:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eOver 4 years of experience in Back End Data Analyst positions\u003c/li\u003e\u003cli\u003eExcellent knowledge of SQL and ETL tools\u003c/li\u003e\u003cli\u003eHands-on experience with data cleansing, mapping and transformation procedures\u003c/li\u003e\u003cli\u003eExperience of cloud-based platforms\u003c/li\u003e\u003cli\u003eKnowledge of GDPR guidelines\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe Data Migration Analyst role will be offered a highly competitive wage paying from £300 - £400 per day depending on experience.\u003c/p\u003e\u003cp\u003eFor more information about the Data Migration Analyst role or to apply send your CV now to (see below) Apply soon before the position is filled!\u003c/p\u003e\u003cp\u003eReuben Sinclair are a multi award winning recruitment company including: UK's Best Recruitment Consultant, UK's Best Specialist Recruitment Agency, UK's Best Agency Side Recruiter, One of only 30 UK Hyper Growth companies, UK's Most Innovative Recruitment Company, UK's Most Innovative Recruiter, UK's Best Agency Side Recruiter, UK's Best Agency Side Recruiter\u003c/p\u003e\u003cp\u003eWe specialise in delivering recruitment solutions for complete brand engagement: Sales, Marketing, PR \u0026amp; Digital and work with some of the most innovative, entrepreneurial and award winning companies across industry. \u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-NHDMA\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Reuben Sinclair\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Nicholas Hammond","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa17f"},"JobId":"ED7AEB4E45DA0CA6","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=ED7AEB4E45DA0CA6","Title":"Technical BI Analyst - Lloyd's Market Insurance (Contract)","Description":"Technical BI Analyst - Lloyd's Market Insurance (Contract) \u003cp\u003eHi all,\u003c/p\u003e \u003cp\u003eI am currently working on a very exciting Lloyd's Market Opportunity for a Technical BI Analyst.\u003c/p\u003e \u003cp\u003eLocation - Central London\u003c/p\u003e \u003cp\u003eRate - £450-500 per day\u003c/p\u003e \u003cp\u003eDuration - 6 months\u003c/p\u003e \u003cp\u003e\u003cu\u003e\u003cstrong\u003eOpportunity\u003c/strong\u003e\u003c/u\u003e\u003c/p\u003e \u003cp\u003eAre you..\u003c/p\u003e \u003cp\u003eA Technical BI Analyst who can work Independently and is able to understand business objectives and translate these into a technical solution?\u003c/p\u003e \u003cp\u003eDo you have..\u003c/p\u003e \u003cul\u003e \u003cli\u003eExperience with Financial reporting and Sun Accounts\u003c/li\u003e \u003cli\u003eExperience of Lloyd's Market Reporting. \u003cbr\u003eSpecifically: \u003cul\u003e \u003cli\u003eTechnical Provisions Data (TPD)\u003c/li\u003e \u003cli\u003eQuarterly Monitoring Returns (QMR) \u003cul\u003e \u003cli\u003eQMA - Accounting and Analysis\u003c/li\u003e \u003cli\u003eQMB -Class of Business Performance\u003c/li\u003e \u003cli\u003eQMC - Solvency II Balance Sheet\u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003eData Warehouse Design and Development\u003c/li\u003e \u003cli\u003eExperience of relatively complex SQL queries - More experienced than simple selects and joins, such as using temp tables, window functions, (un)pivots\u003c/li\u003e \u003c/ul\u003e \u003cp\u003eif so I would like to speak to you!\u003c/p\u003e \u003cp\u003e\u003cstrong\u003e*To be considered for this role you must have Lloyd's Market Insurance Experience*\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003e (see below) \u003c/strong\u003e\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JSLLOYD'S MARKET\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Empiric Solutions\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Diego Baynes","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa180"},"JobId":"62868F27BA6CF8AB","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=62868F27BA6CF8AB","Title":"Infrastructure Delivery Architect (Contract)","Description":"Infrastructure Delivery Architect (Contract) \u003cp\u003e\u003cstrong\u003eBased in London or Wimbledon\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003e6 months+ contract\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eImmediate start\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003e£500 daily rate\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eIDPP is currently recruiting for an Infrastructure Architect for a large financial firm based in London.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eKey responsibilities: \u003c/strong\u003e\u003c/p\u003e \u003cul\u003e \u003cli\u003eAct as a technical subject matter expert in the Core Close Brothers Infrastructure technologies.\u003c/li\u003e \u003cli\u003eManage the entire project life cycle of technical/infrastructure solution designs.\u003c/li\u003e \u003cli\u003eEngage with relevant 3rd parties and advise on technical assessments of 3rd parties\u003c/li\u003e \u003cli\u003eEstablish both baseline and target state requirements so as to demonstrate how recommended infrastructure solutions meet the business requirements and add value.\u003c/li\u003e \u003cli\u003eCreate and develop high-level Infrastructure Architecture documents in line with current standards for new projects and upgrades.\u003c/li\u003e \u003cli\u003eIdentify existing unleveraged infrastructure capability for re/use and optimization\u003c/li\u003e \u003cli\u003eAssist engineering teams to create and update all project documentation relating to the low level design, ensuring adherence to both IT architecture and high-level design principles.\u003c/li\u003e \u003cli\u003eTroubleshoot and problem solve during project development \u0026amp; test prior to implementation\u003c/li\u003e \u003cli\u003eAssist in the creation of workflows, knowledgebase articles, training and operational support processes to ensure smooth transition into service management\u003c/li\u003e \u003cli\u003eDeliver to agreed timescales and costs\u003c/li\u003e \u003cli\u003eAssist in technical performance assessments.\u003c/li\u003e \u003cli\u003eContribute to all research and development activities.\u003c/li\u003e \u003cli\u003eMaintain an awareness of emerging technologies and trends\u003c/li\u003e \u003c/ul\u003e \u003cp\u003e\u003cstrong\u003eSkills and experience:\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eEssential:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e \u003cli\u003eThe successful candidate will possess an in depth understanding \u0026amp; experience of infrastructure technologies \u0026amp; proven track record of architecting solutions.\u003c/li\u003e \u003cli\u003eExperience of translating business requirements into technical high level designs.\u003c/li\u003e \u003cli\u003eAble to produce detailed technical specifications and documentation.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIn depth technical Skills in the following technologies: \u003cbr\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eVMWare and Virtualisation technologies\u003c/li\u003e\u003cli\u003eWindows Server/Desktop platforms and technologies.\u003c/li\u003e\u003cli\u003eMiddleware technologies eg IBM Integration Bus, MS Biztalk, SAP PI, MQ and JMS messaging.\u003c/li\u003e\u003cli\u003eJBOSS and other Application Server technologies.\u003c/li\u003e\u003cli\u003eLocal and Wide area networks\u003c/li\u003e\u003cli\u003eExperience of designing/building Application, Web (including Apache/Tomcat, IIS) and Database Servers.\u003c/li\u003e\u003cli\u003eStorage SAN/NAS\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eDesirable \u003c/p\u003e\u003cul\u003e\u003cli\u003eSQL and Oracle Database Technologies\u003c/li\u003e\u003cli\u003eLinux (Red Hat preferred)\u003c/li\u003e\u003cli\u003eTelephony (Cisco Preferred)\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e \u003c/p\u003e\u003cul\u003e \u003c/ul\u003e\u003cp\u003e \u003c/p\u003e\u003cul\u003e \u003c/ul\u003e \u003cp\u003eIn addition to the technical skills detailed above, the candidate should be able to demonstrate:\u003c/p\u003e \u003cul\u003e \u003cli\u003eAbility to collaborate and communicate effectively with IT and non-IT staff at all levels.\u003c/li\u003e \u003cli\u003eAnalytical thinker, and experienced problem solver.\u003c/li\u003e \u003cli\u003eHave an excellent eye for detail.\u003c/li\u003e \u003cli\u003eMindfulness of User Experience and supportability focusing on simplicity and ease of use\u003c/li\u003e \u003cli\u003eCommercially astute.\u003c/li\u003e \u003cli\u003eStrong interpersonal, presentation and negotiation skills.\u003c/li\u003e \u003cli\u003eStrong communication skills - both verbal and written.\u003c/li\u003e \u003cli\u003eBe proactive, driven and have the ability to work both in team and independently without supervision.\u003c/li\u003e \u003cli\u003ePlanning and time management skills\u003c/li\u003e \u003cli\u003eExposure to working within a structured ITIL environment\u003c/li\u003e \u003c/ul\u003e \u003cp\u003e\u003cstrong\u003e Desirable:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e \u003cli\u003eUnderstand the methods and techniques associated with planning and monitoring of projects.\u003c/li\u003e\u003cli\u003eHave experience of prototyping or proof of concept exercises to valid and evaluate the benefits of applying a particular technology to a business need. \u003c/li\u003e\u003cli\u003eBe familiar with Risk Management and Service Management frameworks.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e \u003c/p\u003e\u003cul\u003e \u003c/ul\u003e \u003cp\u003eIf this is of interest please apply today!\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e IDPP\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Viktoriya Chausheva","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa181"},"JobId":"D801238400CFA454","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=D801238400CFA454","Title":"Python Developer (Contract)","Description":"Python Developer (Contract) \u003cp\u003e\u003cstrong\u003ePython Developer, London\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA new opportunity has arisen with our client for a Python Developer based in London on an initial 3 month assignment and it is likely to be extended.\u003c/p\u003e\u003cp\u003eThe core activities of this role will include developing production applications in Python, designing and working with relational databases, writing and maintaining production-grade SQL and writing scalable and highly performant scripts.\u003c/p\u003e\u003cp\u003eIn addition to your ability to complete these tasks, experience in Cloud and Agile environments would be very useful. As would any other Scripting languages, ETL development, experience of data migration from data warehouse platform 'a' to data warehouse platform 'b', any work with various data formats XML, JSON, CSV etc and an understanding of Apache Spark and Scala.\u003c/p\u003e\u003cp\u003eThis vacancy is advertised by Agile Recruitment Ltd. The services advertised by Agile Recruitment Ltd for contract and interim recruitment are those of an Employment Business and for permanent and fixed-term recruitment are those of an Employment Agency.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-CPDL18\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Agile Recruitment Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Johanna Vilay","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa182"},"JobId":"433202195FF8216D","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=433202195FF8216D","Title":".NET DEVELOPER - FTSE 100 COMPANY! (Contract)","Description":".NET DEVELOPER - FTSE 100 COMPANY! (Contract) \u003cp\u003e\u003cstrong\u003e.NET Developer\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e£450-£550 per day\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCentral London \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eArrows Group are currently partnered with a well known eCommerce company who are looking for a highly skilled .NET Developer for an immediate start. \u003c/p\u003e\u003cp\u003eAs a .NET Developer you will have experience working with high traffic web pages, exposure to public clouds and be an expert in C# and .NET. \u003c/p\u003e\u003cp\u003eKnowledge of event based systems would be a huge bonus!\u003c/p\u003e\u003cp\u003eSkills required:\u003c/p\u003e\u003cul\u003e\u003cli\u003eC#\u003c/li\u003e\u003cli\u003eCloud computing especially AWS\u003c/li\u003e\u003cli\u003eExperience in Scripting (Python, Ruby, Perl or Shell)\u003c/li\u003e\u003cli\u003eASP.NET MVC\u003c/li\u003e\u003cli\u003eTDD\u003c/li\u003e\u003cli\u003eMessage queues\u003c/li\u003e\u003cli\u003eHTML, CSS, JavaScript \u0026amp; Responsive Web Design\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIf this role sounds of interest to you, please contact me. \u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-AM12\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Arrows Group\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Amy Maryniak","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa183"},"JobId":"7408C5553CC2126C","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=7408C5553CC2126C","Title":"Senior BI Cloud Engineer (Contract)","Description":"Senior BI Cloud Engineer (Contract) \u003cp\u003eSenior BI Google Cloud Engineer\u003cbr\u003e\u003cbr\u003eSenior BI Cloud Engineer required by Whitehall Resources for an initial 3 Month contract to be based in London. The successful candidate should have strong technical leadership capabilities and an appetite to develop junior members of the team. The ideal candidate must have strong communication skills as there will be a high level of engagement with senior stakeholders.\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eExperience Required \u003cbr\u003e\u003c/strong\u003e\u003cbr\u003e* Google Cloud Platform (GCP)\u003cbr\u003e\u003cbr\u003e* Google Big Query\u003cbr\u003e\u003cbr\u003e* Experience with Power BI, Talend, SPSS, Apache Airflow\u003cbr\u003e\u003cbr\u003e* Oracle Business Intelligence Enterprise Edition (OBIEE) Development experience.\u003cbr\u003e\u003cbr\u003e* Strong PL/SQL and SQL skills.\u003cbr\u003e\u003cbr\u003e* Experience with OBIEE and Power BI.\u003cbr\u003e\u003cbr\u003e* Additional experience with ETL and Visualisation tools (ODI, OBIEE and Power BI) \u003cbr\u003e\u003cbr\u003e* A good working knowledge of Power BI, Talend, SPSS, Apache Airflow or Proc C*\u003cbr\u003e\u003cbr\u003e* Strong stake holder management skills\u003cbr\u003e\u003cbr\u003eGCP | GOOGLE | OBIEE | ODI | Power BI | PL/SQL | SQL | Oracle Business Intelligence Enterprise Edition | Oracle BI | Oracle Data Integrator\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-ORC/LB/31964\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Whitehall Resources Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Liam Boyles","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa184"},"JobId":"E68F0EB5022B5DE4","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=E68F0EB5022B5DE4","Title":"Sharepoint Support Specialist (Contract)","Description":"Sharepoint Support Specialist (Contract) \u003cp\u003e\u003cstrong\u003eApplication Support Specialist required for a leading client in Crawley \u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eThis position requires a contractor 4 days a week 7.5 hours a day\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eThe Application Support Specialist \u003c/strong\u003e\u003cstrong\u003ewill be responsible for providing administrative support for\u003c/strong\u003e (but not limited to):\u003c/p\u003e \u003cul\u003e \u003cli\u003eCRM\u003c/li\u003e \u003cli\u003eVarious Local and Global systems\u003c/li\u003e \u003cli\u003eSoftware Upgrade Support\u003c/li\u003e \u003cli\u003ePorting customisation from test to production\u003c/li\u003e \u003cli\u003eLiaison with the Business in relation to the Applications future expansion\u003c/li\u003e \u003c/ul\u003e \u003cp\u003e\u003cstrong\u003eEssential Skills\u003c/strong\u003e required for this position:\u003c/p\u003e \u003cul\u003e \u003cli\u003eSharePoint, SQL\u003c/li\u003e \u003cli\u003eWindows Server, SFTP\u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIn addition we are looking for an individual that\u003c/p\u003e \u003cul\u003e \u003cli\u003eIs flexible\u003c/li\u003e \u003cli\u003eHas the ability to communicate effectively with internal and external customers.\u003c/li\u003e \u003cli\u003eHas good organisation skills \u0026amp; IT Skills\u003c/li\u003e \u003cli\u003eHas the ability to work under pressure\u003c/li\u003e \u003cli\u003eHas the ability to work and switch between multiple applications\u003c/li\u003e \u003cli\u003eHas an exceptional attention to detail\u003c/li\u003e \u003cli\u003eA team player is essential\u003c/li\u003e \u003cli\u003eFluency in English is essential. A second European language is a benefit.\u003c/li\u003e \u003c/ul\u003e \u003cp\u003eDue to the volume of applications received for positions it will not be possible to respond to all applications and only applicants who are considered suitable for interview will be contacted.\u003c/p\u003e \u003cp\u003eProactive Appointments Limited operates as an employment agency and employment business and is an equal opportunities organisation\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JSASSC/26101\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Proactive Appointments\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Resource Team","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa185"},"JobId":"2A7FAA550E6BF954","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=2A7FAA550E6BF954","Title":"C# Developer (Contract)","Description":"C# Developer (Contract) \u003cp\u003eC# Developer - .NET, AWS, MVC, WCF, Agile, TDD\u003c/p\u003e\u003cp\u003eAn internationally recognised eCommerce company based in London is seeking an experienced C# Developer with strong Agile experience to work on their highly transactional Real Time systems including development of a Greenfield payment system.\u003c/p\u003e\u003cp\u003eYou will join a team of gifted C# Developers using .NET 4.0, WCF, NHibernate, MVC, TDD, BDD and XP. Candidates will need a strong technical background and be a good software engineer as well as coder. You should have experience working on large web applications and working in an agile environment.\u003c/p\u003e\u003cp\u003eStrong candidates will have:\u003c/p\u003e\u003cul\u003e\u003cli\u003eExtensive experience as a C# Developer with .NET 3.5/4.0, WCF, MVC\u003c/li\u003e\u003cli\u003eExtensive AWS experience \u003c/li\u003e\u003cli\u003eAgile including TDD and knowledge of BDD\u003c/li\u003e\u003cli\u003ePair programming,\u003c/li\u003e\u003cli\u003eFull life cycle development\u003c/li\u003e\u003cli\u003eLarge E-commerce development/environment\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThis is a fantastic opportunity for a C# Developer to work in a team of highly skilled people, all with strong opinions about various technologies, frameworks and approaches to delivery. You will have to be confident in articulating ideas to colleagues effectively and will take on board the ideas of others, but have the strength in your own conviction. There will continually be new challenges as the company strives to maintain its position as the market leader.\u003c/p\u003e\u003cp\u003eIf you feel that this is the sort of environment in which you could flourish and would like to know more please send your CV.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-DSOD4949\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Oliver Bernard\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Tom Nicholls","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa186"},"JobId":"C6A192C3D2DD819A","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=C6A192C3D2DD819A","Title":"C# Developer (Contract)","Description":"C# Developer (Contract) \u003cp\u003eC# Developer - WPF, SQL, TDD\u003c/p\u003e\u003cp\u003eA leading provider of trading solutions to traders, brokers and exchanges worldwide is seeking an accomplished C# Developer to join their London team. The successful C# Developer will be working on their flagship financial application providing Greenfield features.\u003c/p\u003e\u003cp\u003eDesired skills as a C# Developer:\u003c/p\u003e\u003cul\u003e\u003cli\u003eC#\u003c/li\u003e\u003cli\u003eWPF, WCF\u003c/li\u003e\u003cli\u003eSQL Server\u003c/li\u003e\u003cli\u003eSCRUM, XP and Kanban\u003c/li\u003e\u003cli\u003eBDD/ATDD (Fit, FitNesse and others), TDD (UI and non-UI)\u003c/li\u003e\u003cli\u003eContinuous Integration, Jenkins, TFS BUILD\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThey are a hugely innovative company who are constantly striving to add new applications and functionality to their services, and never settle. The company themselves operate a relaxed, yet technically sharp, environment and are growing at a rapid pace.\u003c/p\u003e\u003cp\u003eIf you are a C# Developer and would like to know more please apply for further details.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-DFOS8745\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Oliver Bernard\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Tom Nicholls","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa187"},"JobId":"64E29345F4C44454","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=64E29345F4C44454","Title":"Lead Software Engineer, C#.NET, Azure/AWS, ASP.NET, MVC, API (Contract)","Description":"Lead Software Engineer, C#.NET, Azure/AWS, ASP.NET, MVC, API (Contract) \u003cp\u003eLead Software Engineer, C#.NET, Azure/AWS, ASP.NET, MVC, API, \u003cbr\u003e\u003cbr\u003eA leading E-commerce client is seeking a Lead Software Engineer with recent experience of .Net, C#, ASP.NET and Azure based cloud services \u003cbr\u003e\u003cbr\u003eThe role: \u003cbr\u003eAs a Senior Software Engineer you will be a Powerhouse of software design and delivery internally. Working as part of a strong cross function agile team you will drive quality and technology forward bringing your skill and experience to bear across the team. \u003cbr\u003eWork within a fast-paced engineering team helping drive the delivery and technical competency of you team and the entire department forward \u003cbr\u003eWork within an agile environment \u003cbr\u003eWorking with Solution Architect to ensure the team delivers to required quality and adheres to best practice \u003cbr\u003eTake responsibly for the delivery for takes from initial design to delivery into production \u003cbr\u003e\u003cbr\u003eSkills: \u003cbr\u003eProven experience of working in teams in the successful delivery of complex, highly performing and high quality software systems \u003cbr\u003eStrong stakeholder management skills \u003cbr\u003eMentoring skills \u003cbr\u003eBroad base of knowledge in the below: \u003cbr\u003eC# \u003cbr\u003e.Net 3.5/4 \u003cbr\u003eASP.NET \u003cbr\u003eWCF \u003cbr\u003eSQL(T-SQL) \u003cbr\u003eHTML, CSS, JQuery, JavaScript \u003cbr\u003eTesting \u003cbr\u003e\u003cbr\u003eDistributed message system design/development \u003cbr\u003eRecent experience with: \u003cbr\u003eAzure/AWS cloud services - the last 2 roles \u003cbr\u003eWebsite design, usability, accessibly \u003cbr\u003eTest automation \u003cbr\u003eMessage Queuing tech \u003cbr\u003e\u003cbr\u003eLead Software Engineer, C#.NET, Azure/AWS, ASP.NET, MVC, API,\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-LSS-DS-01\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Apollo Solutions Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Dan Shannon","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa188"},"JobId":"AD37F123DD0366EA","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=AD37F123DD0366EA","Title":"DevOps Engineer AWS (Cloudformation, Ansible/Salt, Octopus, Team City/Jenkins) (Contract)","Description":"DevOps Engineer AWS (Cloudformation, Ansible/Salt, Octopus, Team City/Jenkins) (Contract) ","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa189"},"JobId":"3915CBEB591D14F2","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=3915CBEB591D14F2","Title":"Contract JavaScript Developer - React (Contract)","Description":"Contract JavaScript Developer - React (Contract) \u003cp\u003eSenior JavaScript Developer - React\u003c/p\u003e\u003cp\u003eup to 450/day\u003c/p\u003e\u003cp\u003e6 months, Central/West London\u003c/p\u003e\u003cp\u003eWe are looking for an exceptional JavaScript developer to work with our client - a globally recognised media brand.\u003c/p\u003e\u003cp\u003eThis will be a 6 months contract to build a React application with ES6 to the highest standards.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe React JavaScript contractor will have:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e- Minimum 4 years of commercial experience in JavaScript development\u003c/p\u003e\u003cp\u003e- Good knowledge of ReactJs, ES6\u003c/p\u003e\u003cp\u003e- Experience building large cross-platform services\u003c/p\u003e\u003cp\u003e- Webpack, NMP \u003c/p\u003e\u003cp\u003e- Design patterns \u003c/p\u003e\u003cp\u003e- SCSS, HTML, ES6\u003c/p\u003e\u003cp\u003e- unit testing \u003c/p\u003e\u003cp\u003e- TDD\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDesired skills and experience for Front End Javascript Developer:\u003cbr\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e- Media/video application experience (especially VoD, OTT or any streaming technology highly preferred)\u003c/p\u003e\u003cp\u003e- Nodejs, PHP, C# or Java \u003c/p\u003e\u003cp\u003e- Experience with commonly used databases and libraries.\u003c/p\u003e\u003cp\u003eThis is an amazing contract role available ASAP. \u003cstrong\u003eGet in touch via linked in with Dagmara Kukla or apply here!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003ePLEASE NOTE: Due to the high volume of applications we receive we are unable to respond to everyone. If you have not heard from us within 5 working days of sending your CV then unfortunately you have not been shortlisted for the position you have applied for.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-BBBH57869\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Handle Recruitment Limited\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Dagmara Kukla","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa18a"},"JobId":"AF831C88CBD5373D","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=AF831C88CBD5373D","Title":"Database Developer - SQL/SSIS Developer (Contract)","Description":"Database Developer - SQL/SSIS Developer (Contract) \u003cp\u003eDatabase Developer - SQL/SSIS Developer\u003c/p\u003e\u003cp\u003eCity, London\u003c/p\u003e\u003cp\u003eContract - 6 months\u003c/p\u003e\u003cp\u003eDaily Rate - £450/day\u003c/p\u003e\u003cp\u003eSQL/T-SQL/Data Integration/Informatica/SSIS/ETL/Data Warehouse/SQL Server\u003c/p\u003e\u003cp\u003eMy client is a leading Lloyd's of London insurer who are seeking a hands-on Database Developer to join their team. This role will be London based, with possible ad-hoc visits to Guilford as and when required.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe role\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eTo support the current development team with a focus on the analysis and hands-on development of SQL based systems and Data Marts. The post holder will be required to support the integrations with multiple systems, ensuring accuracy and quality of data by implementing business and technical reconciliations.\u003c/p\u003e\u003cp\u003eThe role will entail hands on development and maintenance of the SQL based systems and various associated components for data ingestion, transformation and processing. Providing development and maintenance of integrations with various Financial, Underwriting and Claims Management Systems.\u003c/p\u003e\u003cp\u003eTo be considered for this contract role, \u003cstrong\u003eapplicants must have a minimum 5 years or more experience\u003c/strong\u003e in a development role handling Data/SQL Integration Projects.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExperience Required\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eEnsuring data quality and accuracy by implementing business and technical reconciliations via scripts, profiling and data analysis.\u003c/li\u003e\u003cli\u003eDevelop and support objects and code for data profiling, extraction, load and updates.\u003c/li\u003e\u003cli\u003eProvide and maintain documentation for all developed objects and processes.\u003c/li\u003e\u003cli\u003eIntegration testing of deliverables.\u003c/li\u003e\u003cli\u003eDevelop and run test scripts to ensure the quality of code and integrity.\u003c/li\u003e\u003cli\u003eUse source code control repository (using VSTS)\u003c/li\u003e\u003cli\u003eFollowing data/integration design patterns and architecture as prescribed by the Architects.\u003c/li\u003e\u003cli\u003ePossess and demonstrate deep knowledge of data warehouse concepts, techniques, various design alternatives, and overall data warehouse strategies.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eTechnical Skill requirements\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eSQL server database objects (Stored Procedures, Triggers, Views etc.)\u003c/li\u003e\u003cli\u003eT-SQL Query Optimization with Indexes.\u003c/li\u003e\u003cli\u003eSSIS integration tasks.\u003c/li\u003e\u003cli\u003eEnterprise data warehouse implementation using SSIS and SQL Server Objects.\u003c/li\u003e\u003cli\u003eETL Code/Integration using Informatica.\u003c/li\u003e\u003cli\u003eType 2 Dimension Data model and data warehouse ETL techniques for historical data.\u003c/li\u003e\u003cli\u003eData Mapping and Low Level/ETL Design Documentation.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eSQL/T-SQL/Data Integration/Informatica/SSIS/ETL/Data Warehouse/SQL Server\u003c/p\u003e\u003cp\u003eDatabase Developer - SQL/SSIS Developer \u003c/p\u003e\u003cp\u003eCity, London\u003c/p\u003e\u003cp\u003eContract - 6 months \u003c/p\u003e\u003cp\u003eDaily Rate - £450/day\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-MJ/I3/DD\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e i3 Resourcing\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Matt Jones","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa18b"},"JobId":"2C6E2D2F44F48A15","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=2C6E2D2F44F48A15","Title":"Oracle eBusinessSuite (EBS) Technical Consultant - SQL - (Contract)","Description":"Oracle eBusinessSuite (EBS) Technical Consultant - SQL - (Contract) \u003cstrong\u003eOracle eBusinessSuite (EBS) Technical Consultant - SQL - R12 - P2P Media - West London - France\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e EBS Oracle Technical Consultant required by global Media organisation in a business facing capacity to facilitate workshops with finance staff as part of a global roll out. \u003cbr\u003e\u003cbr\u003e The postion will require excellent experience with the Record to Report functionality, particularly looking at the General Ledger (GL). \u003cbr\u003e\u003cbr\u003e The role will require experience working with the Oracle R12 Procure to Pay function with a focus on procurement and expenses modules. \u003cbr\u003e\u003cbr\u003e This project will be focused on a roll out in France initially, so experience of the French Legal and Statutory requirements is required and French speaking candidates are desired.\u003cbr\u003e\u003cbr\u003e \u003cstrong\u003eExperience/Skills required\u003c/strong\u003e\u003cbr\u003e \u003cul\u003e\u003cli\u003eExcellent Oracle R12 Experience\u003c/li\u003e\u003cli\u003eBusiness facing, able to lead a workshop with finance staff\u003c/li\u003e\u003cli\u003eDeep experience on Record to Report, particularly GL and reporting\u003c/li\u003e\u003cli\u003eExperience on Procure to Pay projects including procurement and expenses modules\u003c/li\u003e\u003cli\u003eExperience working on a French project and an understanding of the French Legal + Statutory requirements including end to end implementation through to launch and post-launch support to a business in France\u003c/li\u003e\u003cli\u003eHands-on experience on Oracle Standard API's around EBS Modules\u003c/li\u003e\u003cli\u003eFamiliar with demands of continuous delivery model - the teams operate on a somewhat agile basis with sprints, stand-ups, backlogs, burnups etc.\u003c/li\u003e\u003c/ul\u003e \u003cstrong\u003eDesirable\u003c/strong\u003e\u003cbr\u003e \u003cul\u003e\u003cli\u003eBusiness proficient French speaker\u003c/li\u003e\u003c/ul\u003e This is an initial 6 month contract that will likely be extended, starting as soon as possible. If of interest please do apply ASAP.\u003cbr\u003e\u003cbr\u003eCornwallis Elt is an Employment Agency and has been listed 3 times in The Sunday Times Virgin Fast Track 100 of the UK`s fastest growing private companies, as well as in the Recruitment International Top 250, Top 50 in IT and the Recruiter Fast 50. \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS BHJOB6067_12785\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Cornwallis Elt Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Megan Wood","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa18c"},"JobId":"DA8B9813AED39319","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=DA8B9813AED39319","Title":"WPF .NET Developer - Insurance Desktop App (Contract)","Description":"WPF .NET Developer - Insurance Desktop App (Contract) \u003cp\u003e\u003c/p\u003e\u003cp\u003eRoc Search - .NET Desktop Application Developer - WPF - SQL - 6 Month Rolling - ASAP Start - £450 per day - City of London\u003cbr\u003e \u003cbr\u003e Roc Search are working with a well known Insurance brand, helping them locate a .NET Developer to work on multiple Insurance Desktop Applications. \u003cbr\u003e \u003cbr\u003e Skill set required\u003cbr\u003e C# WPF\u003c/p\u003e\u003cp\u003eMultithreading\u003cbr\u003e Prism\u003c/p\u003e\u003cp\u003eAdvanced SQL 2014 and some SQL 2016 is ideal\u003cbr\u003e \u003cbr\u003e Nice to have\u003cbr\u003e SSIS Cubes exposure\u003cbr\u003e Cloud (Azure) exposure\u003cbr\u003e SOA\u003c/p\u003e\u003cp\u003eRate: neg around £450 per day\u003cbr\u003e Location: City of London\u003cbr\u003e Duration: 6 months Rolling\u003c/p\u003e\u003cp\u003ePlease apply with your up to date CV if interested.\u003cbr\u003eContact Michael Nourse at Roc Search for more informati (see below) \u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-129091/001\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Roc Search Limited\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Michael Nourse","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ec03b6c003622ec4fa18d"},"JobId":"1E0192EB9A4D1111","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=1E0192EB9A4D1111","Title":"Developer - C#, .Net, Azure, SQL Server, T-SQL, SOA (Contract)","Description":"Developer - C#, .Net, Azure, SQL Server, T-SQL, SOA (Contract) ","CreatedAt":"2018-02-22 130516"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637c3"},"JobId":"987DE4AB34E18F39","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=987DE4AB34E18F39","Title":"Data Engineer (Hive, Hadoop) - Urgent! (Contract)","Description":"Data Engineer (Hive, Hadoop) - Urgent! (Contract) \u003cp\u003eCloud Consulting have an urgent requirement for an experienced Data Engineer to join a transformation programme with a leading financial services group. This will be working in the Data Science team which applies advanced data science methods to key business problems and opportunities. The teams are tasked with identifying opportunities for analytics across the business, to rapidly build machine learning prototypes and to engineer production quality software of data systems and machine learning.\u003c/p\u003e \u003cp\u003eTo be suitable, you should have the following experience:\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eHIVE/SQL\u003c/strong\u003e - Optimisation performance - familiarity with partitioning, bucketing, indexing etc. \u003c/p\u003e \u003cp\u003e\u003cstrong\u003eHadoop\u003c/strong\u003e - ie kafka, storm, Spark, oozie etc,\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eDatamodelling\u003c/strong\u003e - Knowledge of Datamodelling within an Enterprise data warehouse/Big Data environment. ie denomalised views, star schemas, third-normal form, OLAP cubes etc\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eData quality + lineage\u003c/strong\u003e - ensuring the quality of data is governance and documented in accordance with Group-wide standards.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eMachine Learning,\u003c/strong\u003e stats, modelling etc - knowledge of the practical application of these techniques is required, but the ability to build a model is not.\u003c/p\u003e \u003cp\u003eIf this is of interest, please forward your C.V ASAP with an indication of rate and availability.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-DATAENGINEER\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Cloud Consulting\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Delivery Team","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637c4"},"JobId":"4BD24EDDDF50D51F","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=4BD24EDDDF50D51F","Title":"Classic ASP Developer (Contract)","Description":"Classic ASP Developer (Contract) \u003cp\u003eClassic ASP Developer - SQL Server, ASP.NET, IIS, Prototype, JQuery, Bootstrap, MVC, C#\u003c/p\u003e\u003cp\u003eCity Legal firm are seeking a Classic ASP Developer to join their London office and be responsible for the design, build and maintenance of scalable bespoke applications. The Classic ASP Developer will be working on operational critical projects to designated specifications meeting tight deadlines and within budget, in order to produce effective, and commercially viable, web-based applications.\u003c/p\u003e\u003cp\u003eExperience as a Classic ASP Developer will include:\u003c/p\u003e\u003cul\u003e\u003cli\u003eExcellent knowledge and understanding of the range of database and web server technologies including:\u003c/li\u003e\u003cli\u003eClassic ASP, SQL Server, ASP.NET, IIS, Prototype, JQuery, Bootstrap, MVC, C#\u003c/li\u003e\u003cli\u003eExcellent knowledge and understanding of the range of common web technologies including:\u003c/li\u003e\u003cli\u003eHTML, CSS, JavaScript and AJAX\u003c/li\u003e\u003cli\u003eGood understanding of software design principles and design patterns\u003c/li\u003e\u003cli\u003eContribute to the maintenance of the appropriate processes and service standards to all customers and potential customers.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e Classic ASP Developer - SQL Server, ASP.NET, IIS, Prototype, JQuery, Bootstrap, MVC, C#\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-SSDI5654\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Oliver Bernard\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Tom Nicholls","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637c5"},"JobId":"2AD06A0416740193","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=2AD06A0416740193","Title":"Integration Specialist - HL7, SQL, XML - London - IR35 (Contract)","Description":"Integration Specialist - HL7, SQL, XML - London - IR35 (Contract) \u003cp\u003eIntegration Specialist - HL7, SQL, XML - Contract - London\u003c/p\u003e\u003cp\u003eMy client is currently looking for an Integration Specialist for an initial 3-month contract in West London.\u003c/p\u003e\u003cp\u003eRate: £400-500 per day (Inside IR35)\u003cbr\u003e \u003cbr\u003eLocation: West London \u003cbr\u003e \u003cbr\u003eDuration: 3 months \u003cbr\u003e \u003cbr\u003eStart Date: ASAP\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePlease note this role falls inside of IR35.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThis role will include system and data integration, support and maintenance of the client's integration engine software This will include detailed requirements analyst, design, implantation and testing of new interfaces.\u003c/p\u003e\u003cp\u003eWe are looking for experience with the following:\u003c/p\u003e\u003cul\u003e\u003cli\u003eCloverleaf HL7 Messaging\u003c/li\u003e\u003cli\u003eOracle DB Integration\u003c/li\u003e\u003cli\u003eSQL\u003c/li\u003e\u003cli\u003eUNIX Shell Scripts\u003c/li\u003e\u003cli\u003eXML/XSLT\u003c/li\u003e\u003cli\u003eJava\u003c/li\u003e\u003cli\u003eWindows Batch Files\u003c/li\u003e\u003cli\u003eWeb Services\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIntegration Specialist - HL7, SQL, XML - Contract - London\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eParity - Source, Develop, Transform\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eParity Professionals Ltd acts in the capacity of an Employment Business when providing contract work finding services.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-BBBH56658\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Parity Professionals\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Andrew Grist","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637c6"},"JobId":"4FACC960AF1C361F","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=4FACC960AF1C361F","Title":"SQL Developer - ETL - Performance Tuning - Asset Management - London - Contract £600pd (Contract)","Description":"SQL Developer - ETL - Performance Tuning - Asset Management - London - Contract £600pd (Contract) \u003cp\u003e\u003cstrong\u003eSQL Developer - ETL - Performance Tuning - Asset Management - London - Contract - £600pd\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eSQL Developer with extensive performance tuning experience is required for a market leading London based Asset Management firm. I am currently looking for a SQL Developer to work as part of a development team with a focus on data warehouse developer using SQL.\u003c/p\u003e \u003cp\u003eSuitable candidates must have strong ETL, performance tuning experience, CDC (Change Data Capture), Memory Broker, Service Broker along with a Data Warehouse programming and background gained within a an agile environment.\u003c/p\u003e \u003cp\u003eSuccessful candidate will be ambitious dedicated SQL/BI specialists with exceptional skills in the Microsoft BI stack. Experience in T-SQL development and creating enterprise Business Intelligence solutions. You will be a problem solve and demonstrate excellent analytical skills, promptly identifying problems and designing/implementing effective solutions based on Microsoft SQL Server, SSAS, SSRS and SSIS.\u003c/p\u003e \u003cp\u003eOur client required good communications skills, and experience with good knowledge in Fixed Income. \u003c/p\u003e \u003cp\u003eThis is a 6 month rolling contract role paying up to £600 per day. If you're interested then please submit your CV and contact Jamie Jeffery at Westbourne Partners.\u003cbr\u003e \u003cbr\u003e \u003cstrong\u003eSQL Developer - ETL - Performance Tuning - Asset Management - London - Contract - £600pd\u003c/strong\u003e\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Westbourne Partners Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Jamie Jeffery","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637c7"},"JobId":"898952021567D1D5","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=898952021567D1D5","Title":"C# developer - system developer (Contract)","Description":"C# developer - system developer (Contract) ","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637c8"},"JobId":"9A02C6DE467EED21","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=9A02C6DE467EED21","Title":"BI Developer (Contract)","Description":"BI Developer (Contract) \u003cp\u003eJob Title: BI Developer\u003c/p\u003e\u003cp\u003eLocation: London\u003c/p\u003e\u003cp\u003eContract Length: 3 months (rolling)\u003c/p\u003e\u003cp\u003eStart: 26th March\u003c/p\u003e\u003cp\u003eWe're working with a data heavy company who are based in Central London. They're going through a period of change, where Business Intelligence is moving into an Azure environment. As a result, they're looking for an experience BI Developer to come on-board work on this business critical project.\u003c/p\u003e\u003cp\u003eKey skills and experience:\u003c/p\u003e\u003cp\u003e- Full Microsoft BI stack (SSRS, SSIS, SSAS)\u003c/p\u003e\u003cp\u003e- Data Warehousing\u003c/p\u003e\u003cp\u003e- SQL Azure (nice to have)\u003c/p\u003e\u003cp\u003e- ETL development\u003c/p\u003e\u003cp\u003ePlease note, that this contract will be starting late March. \u003c/p\u003e\u003cp\u003eWe understand the need for discretion and would welcome the opportunity to speak to any Microsoft candidates that are considering a new career or job either now or in the future. Confidentiality is of course guaranteed. \u003cbr\u003e\u003cbr\u003eTo discuss the role further and apply: \u003cbr\u003e\u003cbr\u003eContact Levi or alternatively email. \u003cbr\u003e\u003cbr\u003eNigel Frank International is the global leader in Microsoft recruitment. We advertise more Microsoft Business Intelligence jobs than any other agency. We deal with both Microsoft Partners and End Users throughout the UK and Europe and we have never had more live requirements and jobs for Microsoft professionals. \u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-NFI\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Nigel Frank International\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Levi Lewis","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637c9"},"JobId":"3B572D151397AAFE","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=3B572D151397AAFE","Title":".Net Developer - 6 Months (Contract)","Description":".Net Developer - 6 Months (Contract) \u003cstrong\u003e.Net Developer - 6 months\u003c/strong\u003e\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eDescription \u003c/strong\u003e\u003cbr\u003e\u003cbr\u003eAn exciting opportunity for a .NET Developer to work on a modern tech stack has come up in Central London. You will be working with .NET Core to develop web-based applications. This is a great role for a developer who wants to build on their .NET Core experience. \u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eThe .NET Developer should have the following experience:\u003c/strong\u003e\u003cbr\u003e \u003cul\u003e\u003cli\u003e.Net Core, C#, \u003c/li\u003e\u003cli\u003eMVC, ASP.NET, Visual Studio\u003c/li\u003e\u003cli\u003eSQL Server\u003c/li\u003e\u003cli\u003eTFS\u003c/li\u003e\u003cli\u003eAgile\u003c/li\u003e\u003c/ul\u003e Please send across your CV to apply.\u003cbr\u003eInterviews are taking place immediately.\u003cbr\u003e\u003cbr\u003eLocation: Central London\u003cbr\u003eJob Type: 6 Month Contract\u003cbr\u003eRate: £350-£400 per day\u003cbr\u003eLength: 6 months \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JSCORE-AH\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Coded People Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Adam Hurrell","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637ca"},"JobId":"E6ACDA645A30C1C8","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=E6ACDA645A30C1C8","Title":"IT Technical Lead (Contract)","Description":"IT Technical Lead (Contract) \u003cp\u003eWe have a fantastic opportunity for an IT Technical Lead to join a growing professional services firm (c. 5000 users) based in the City Of London. Reporting into the Programme Lead the IT Technical Lead will be responsible for the documenting the required technical solution \u0026amp; integrations for the programme and be a key point of contact for the project in navigating the technical side o delivery. They will be responsible for coordinating test environment requests, representing the project in technical review boards as well as change boards. This role ensures that the technical solution aligns to the original design, and is the key liaison with technical architects and IT strategy.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eKey Accountabilities\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e \u003cli\u003eReporting to IT Programme lead, and where relevant associated project manager.\u003c/li\u003e \u003cli\u003eCreating High and Low-Level Designs to go to the Architectural Review Board for approval.\u003c/li\u003e \u003cli\u003eRepresenting these designs at Architectural Review Board\u003c/li\u003e \u003cli\u003eSupporting the Developers from conceptual design through to development process.\u003c/li\u003e \u003cli\u003eAbility to assist in the estimating process.\u003c/li\u003e \u003cli\u003eManaging test environment requirements\u003c/li\u003e \u003cli\u003eRaising \u0026amp; representing Change Requests at the Change Advisory Board Point of contact for technical queries relating to the project delivery, and responsible for resolving these\u003c/li\u003e \u003c/ul\u003e \u003cp\u003e\u003cstrong\u003eEssential Skills\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e \u003cli\u003eHas created High and Low level technical design documents previously\u003c/li\u003e \u003cli\u003eWorked in Agile and Waterfall environments\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eHas hands-on knowledge and strong SQL experience \u0026amp; knowledge\u003c/strong\u003e\u003c/li\u003e \u003cli\u003eKnowledge of .Net\u003c/li\u003e \u003cli\u003eLead in designing, specifying and selecting information system solutions, considering functionality, data, security,\u003c/li\u003e \u003cli\u003eintegration, infrastructure and performance.\u003c/li\u003e \u003cli\u003eUnderstand and support to software architecture design and support development team in developing solutions\u003c/li\u003e \u003cli\u003eHas lead implementation Project Team members and ensures they are supported and receive clear directions on function and design of information systems.\u003c/li\u003e \u003cli\u003eExperienced in assessing a broad range of information solutions and products particularly document management, collaboration and content management.\u003c/li\u003e \u003cli\u003eExcellent communication skills with the ability to explain technical concepts to lay audiences. Some experience of with working with stakeholders.\u003c/li\u003e \u003cli\u003eTeam player with experience leading and collaborating cross-team to ensure successful delivery of solutions.\u003c/li\u003e \u003cli\u003eStrong conceptual and analytical skills - demonstrating outside-the-box problem-solving skills\u003c/li\u003e \u003cli\u003eWorking knowledge of infrastructure including Servers, storage, Firewalls, load, balancers, Routers, etc.\u003c/li\u003e \u003c/ul\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Picture More Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Jon Lewis","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637cb"},"JobId":"9F385B6E770C248A","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=9F385B6E770C248A","Title":"Senior Devops Engineer 'big 4' (Contract)","Description":"Senior Devops Engineer 'big 4' (Contract) \u003cp\u003e\u003cstrong\u003eWhat we are looking for (Skills and Experience)?\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eHelp design and build monitoring systems, metrics, internal dashboards, and other tools that allow our clients to become increasingly, scalable, and reliable infrastructure.\u003c/li\u003e\u003cli\u003eContinue to cultivate a culture of collaboration, innovation and bringing industry standards to everything we do.\u003c/li\u003e\u003cli\u003eYou have a current understanding of public and private cloud services.\u003c/li\u003e\u003cli\u003eYou understand the fundamentals: Cloud Technologies (AWS, Azure, Google), Windows, Linux, Security and Networking.\u003c/li\u003e\u003cli\u003eYou crave automation and repeatability; why do the boring stuff when you can automate everything\u003c/li\u003e\u003cli\u003e(using any of the following Python, Nodejs, C#, Cloudformation Templating, Ansible/Salt, Octopus, Team City/Jenkins)\u003c/li\u003e\u003cli\u003eAbility to continuously learn, work independently, and make decisions with minimal supervision.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003ePlease apply now!\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-AA-TA-SDE\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Alexander Ash Consulting Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Anthony Adade","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8ef9aa6c00522178e637cc"},"JobId":"44E9E21DF889913D","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=44E9E21DF889913D","Title":"Business Analyst - Custody - Swift - Settlements (Contract)","Description":"Business Analyst - Custody - Swift - Settlements (Contract) ","CreatedAt":"2018-02-22 171056"}
{"_id":{"$oid":"5a8efcd66c005621788ad2d8"},"JobId":"DCE80FEF24969007","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=DCE80FEF24969007","Title":"Senior Software Engineer - .NET (C#) ASP.NET Azure CI/CD BDD (Contract)","Description":"Senior Software Engineer - .NET (C#) ASP.NET Azure CI/CD BDD (Contract) \u003cp\u003eSenior Software Engineer - C#, .Net, MS Azure, Integration, Octopus Deploy, Team City/TeamCity, BDD, SOLID Principles, Agile \u003cbr\u003e\u003cbr\u003eI am currently working with a leading, global E-commerce company based in London for the recruitment of a Senior Software Engineer on a contract basis. \u003cbr\u003e\u003cbr\u003eThis is an amazing opportunity to not only come into an amazing company with a great atmosphere and projects but the opportunity to work on the most innovative, cutting-edge technology solutions within an Agile environment. \u003cbr\u003e\u003cbr\u003eSuccessful candidate: You will be a Senior Software Engineer with commitment to deliver high-quality well-tested software with proven experience of delivering complex, highly performing and high-quality software systems within an Agile environment. You are the heart and soul of the software engineering team building your skills, promoting best practices and aiding the wider teams. \u003cbr\u003e\u003cbr\u003eSkills: \u003cbr\u003e*.NET (C#), \u0026amp; ASP.NET (MVC, API Frameworks)\u003cbr\u003e*Working knowledge of TDD, BDD, Integration (recent exposure to Team City and Octopus Deploy mandatory) \u0026amp; Performance Testing, TFS\u003cbr\u003e*Exposure to Cloud technologies, cloud based development (recent exposure to MS Azure mandatory)\u003cbr\u003e*Experience of Agile and XP Practices\u003cbr\u003e*Exposure to working with Microservices\u003cbr\u003e*Relational \u0026amp; non-Relational Database experience (SQL, MongoDB, RavenDB)\u003cbr\u003e*Design code SOLID principles\u003cbr\u003e\u003cbr\u003eLooking to interview candidates immediately, for more information please apply here or send your CV to (see below) \u003cbr\u003e\u003cbr\u003eSenior Software Engineer - C#, .Net, MS Azure, Integration, Octopus Deploy, Team City/TeamCity, BDD, SOLID Principles, Agile \u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-MS058\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Apollo Solutions Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Maya Stragier","CreatedAt":"2018-02-22 172437"}
{"_id":{"$oid":"5a8effda6c00582178b5198a"},"JobId":"38AEB84A3CCA9BF6","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=38AEB84A3CCA9BF6","Title":".NET C# Developer (remote working available) (Contract)","Description":".NET C# Developer (remote working available) (Contract) \u003cp\u003eRemote working available with weekly site visits. \u003c/p\u003e \u003cp\u003eWe are currently seeking a contract .NET Developer with excellent coding ability in C# to join our digital client in Hemel Hempstead!\u003c/p\u003e \u003cp\u003eYou will be assisting our client's in-house Digital and Development teams on a Software project for one of their large retail clients. You day to day will include Development with C#, planning, leading and analysing projects across the Development Lifecycle process.\u003c/p\u003e \u003cp\u003eOur client is happy to offer flexible working conditions - ie one or two days per week onsite and then the rest remotely. This initial project is fairly short term but there is a strong likelihood of follow-up work.\u003c/p\u003e \u003cp\u003eEssential Skills \u003cbr\u003e A Self-managed individual who is used to working to deadlines and producing excellent quality code. \u003cbr\u003e Working within an Agile environment \u003cbr\u003eo At least 3 or more years experience with .NET\u003cbr\u003eo ASP\u003cbr\u003eo C#\u003cbr\u003eo SQL Server\u003cbr\u003eDesirable skills (non-essential)\u003cbr\u003eo CMS's (WordPress, Umbraco etc)\u003cbr\u003eo Salesforce \u003cbr\u003eThis is an urgent contract requirement with a start date penciled in for the end of February/beginning of March. \u003cbr\u003eWe are holding telephone interviews to secure the Developer ASAP.. \u003cbr\u003ePlease apply\u003cbr\u003eASP.NET, C#, Web Developer, Programmer, WordPress, Legend, .NET, ASP.NET, C#, Web Developer, Programmer, WordPress, Legend, .NET, ASP.NET, C#, Web Developer, Programmer, WordPress, Legend, .NET,\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS/REM/C#/HH212\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e IT Talent Solutions Ltd\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Brian Pyle","CreatedAt":"2018-02-22 173727"}
{"_id":{"$oid":"5a8effda6c00582178b5198b"},"JobId":"8EFF31667691F64A","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=8EFF31667691F64A","Title":"C# Developer - ASP.NET, MVC (Contract)","Description":"C# Developer - ASP.NET, MVC (Contract) \u003cp\u003eC# Developer\u003cbr\u003eASP.NET, C#, Visual Studio, CI/CD, TDD/BDD, \u003cbr\u003e\u003cbr\u003eSenior C# is required for a 3 month initial contract in South London to design, develop, and implement software that provides document bundling and document redacting functionality to the business. \u003cbr\u003e \u003cbr\u003eResponsibilities:\u003cbr\u003e*Full-cycle web application development. \u003cbr\u003e*Design, develop, and implement software in C# ASP.NET\u003cbr\u003e*Deliver code that adheres to the agreed architectures and development guidelines\u003cbr\u003e*Agile software development techniques to produce deployable solutions that meet the functional and non-functional requirements of the business. \u003cbr\u003e\u003cbr\u003eSkills required:\u003cbr\u003e*Proven experience in C# development \u003cbr\u003e*Strong understanding of ASP.NET\u003cbr\u003e*Proven experience working within an Agile environment\u003cbr\u003e*Familiarity with CI/CD principles\u003cbr\u003e*Understanding of Software architecture, micro-services, SOA, TDD, and BDD would be desirable\u003cbr\u003e*Understanding of the following: jQuery, SQL, MVC, HTML, CSS, and Bootstrap \u003cbr\u003e\u003cbr\u003eContract extension highly likely. \u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 22 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-JBALEEC\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Sentinel IT LLP\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Jordan Barwick","CreatedAt":"2018-02-22 173727"}
{"_id":{"$oid":"5a92a3dc830ade1cd4625b40"},"JobId":"\"JAVA\", \"HL7\", \"IR35\", \"STORM\", \"K2\", \"OPENTEXT\", \"WPF\", \"WCF\", \"BASIC\", \"C++\", \"PYTHON\", \"ORACLE\", \"GO\", \"JAVASCRIPT\", \"DOCKER\", \"BANK\", \"MANAGER\", \"ADOBE\", \"SC\", \"CLEARENCE\", \"R\", \"CUBES\", \"CUBE\", \"OLAP\", \"GOOGLE\", \"POSTGRESQL\", \"TERADATA\", \"HIVE\", \"SCALA\", \"SOAP\", \"VB\", \"VBA\", \"LINUX\", \"PL\", \"JQUERY\", \"SPRING\", \"HIBERNATE\", \"ANALYTICS\", \"BIZTALK\", \"ANALYST\", \"SHAREPOINT\", \"ADMINISTRATOR\", \"OFFICE\", \"365\", \"NGINX\", \"APACHE\", \"TOMCAT\", \"SHELL\", \"DEVOPS\", \"POWERBI\", \"BACKBONE\", \"SPECFLOW\", \"POWERPIVOT\", \"BI\", \"TABULAR\", \"INFOPATH\", \"MANAGEMENT\", \"ELASTICSEARCH\", \"NEO4J\", \"JEE\", \"J2E\", \"REACTJS\", \"REACT\", \"KNOCKOUT\", \"DESKTOP\", \"IMPALA\", \"RISK\", \"WINFORMS\", \"SALESFORCE\"","ApplicationURL":"https://www.jobserve.com/gb/en/FastTrackJobApplication.aspx?jobid=6A1CD83A3EC44FBB","Title":"Senior Full Stack .NET Developer (Contract)","Description":"Senior Full Stack .NET Developer (Contract) \u003cp\u003eSenior full stack .NET developer\u003cbr\u003e\u003cbr\u003e Essential:\u003c/p\u003e\u003cul\u003e\u003cli\u003eC#\u003c/li\u003e\u003cli\u003eASP.NET\u003c/li\u003e\u003cli\u003eAngular\u003c/li\u003e\u003cli\u003eHTML\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e Are you currently looking for a full stack developer opportunity and are keen to work for a leading investment banking? If so then carry on reading .\u003cbr\u003e \u003cbr\u003e Your new role\u003cbr\u003e You will primarily be responsible for the development of a new system for a greenfield project that is in the process of being created. Working closely alongside Business Analysts. Extensive development skills will be needed.\u003cbr\u003e \u003cbr\u003e What you'll need to succeed\u003cbr\u003e You will be an excellent communicator and have the ability to logically problem solve in fast paced situations. You will be more Back End focused in order to succeed in this role. Experience in full project life cycle is essential for this role as well as experience in risk - financial services experience is highly desirable. Finally, data/mathematical modelling experience is needed. Also, experience working on Greenfield projects is needed to.\u003cbr\u003e \u003cbr\u003e What you'll get in return\u003cbr\u003e You will be paid up to £600 per day on a 6 month rolling contract. As well as working for a leading investment bank, you will have exposure to the latest technologies and gain great experience.\u003cbr\u003e \u003cbr\u003e What you need to do now\u003cbr\u003e If you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now. \u003c/p\u003e\u003cp\u003eHays Specialist Recruitment Limited acts as an employment agency for permanent recruitment and employment business for the supply of temporary workers. By applying for this job you accept the T\u0026amp;C's, Privacy Policy and Disclaimers which can be found on our website.\u003c/p\u003e \u003cbr\u003e\u003cstrong\u003ePosted Date:\u003c/strong\u003e 23 Feb 2018\u0026nbsp;\u003cstrong\u003eReference:\u003c/strong\u003e JS-3201266\u0026nbsp;\u003cstrong\u003eEmployment Business:\u003c/strong\u003e Hays Specialist Recruitment\u0026nbsp;\u003cstrong\u003eContact:\u003c/strong\u003e Louis Pakarian","CreatedAt":"2018-02-23 182015"}
